{"pageProps":{"postData":{"id":"26-parinpat-larpjaroenphorn","content":"\n![image](/images/2024/26/01.png)\n\n- Sheet Music Detection Player ไม่รู้เล่นไง เราเล่นให้ฟัง เป็น AI สำหรับการอ่านส่วนของชีทเพลงแล้วเปลี่ยนเป็นไฟล์ midi เพื่อช่วยให้นักดนตรี เข้าใจและเรียนรู้เพลงได้อย่างรวดเร็ว\n- ในการเก็บข้อมูลนี้ โปรเจกต์ของผมจะตรงกับ field ของ OMR (Optical Music Recognition) ซึ่งมี dataset แบบ open source มากมายให้เลือก ผมได้เลือกใช้ dataset Deepscore V1 dense extended เนื่องจากเป็น dataset ที่คัดกรองมาจาก Deepscore V1 ซึ่งมีฐานข้อมูลที่ใหญ่กว่า dataset อื่นๆ ใน field นี้และมีข้อมูลของหลาย fonts ด้วย\n- ทั้งนี้บางอย่างในชีทเพลงนั้นไม่ได้สำคํญต่อการเล่นขนาดนั้น ในที่นี้ผมก็ได้ตัด Class ออกจนเหลือแค่ Class ที่สำคัญต่อ rhythm และ pitch มากๆ นั่นก็คือ\n  - Note head แบ่งเป็น โน้ตตัวกลม, โน้ตตัวขาว, โน้ตตัวดำ\n  - Flag แบ่งเป็น เขบ็ต 1 ถึง 5 ชั้น มีทั้งแบบชี้ขึ้นและชี้ลง\n  - Beam\n  - Augmentation Dot\n  - Accidentals แบ่งเป็น Double Sharp, Sharp, Double Flat, Flat, Natural\n- เทรนจาก weights ของ YOLOv8x  และ evaluate โดยใช้ loss และ mAP\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> ผมเป็นคนที่ใฝ่ฝันถึงการทำงานอย่างมีประสิทธิภาพมากที่สุดเสมอ จึงนำไปสู่ความสนใจในเทคโนโลยี โดยเฉพาะปัญญาประดิษฐ์หรือ ai ที่ช่วยจัดการงานต่างๆ ได้อย่างอัตโนมัติ ช่วยให้ชีวิตสะดวกสบายขึ้น ผมจึงมุ่งมั่นตั้งเป้าหมายในชีวิตว่าอยากพัฒนาโปรแกรมที่ช่วยอำนวยความสะดวกในชีวิตประจำวันของผู้คนด้วยแรงผลักดันนี้ ผมจึงมีความประสงค์สมัครเข้าร่วมโครงการ ai builders เพื่อเรียนรู้และเก็บเกี่ยวความรู้เพิ่มเติมเพื่อนำไปต่อยอดสู่ความฝันในการสร้างโปรแกรมที่ช่วยยกระดับคุณภาพชีวิตของทุกคนโครงงาน ai builders เป็นโอกาสอันล้ำค่าของเด็กทุกคนที่มีความสนใจในด้านเทคโนโลยี ai เหมือนผม เป็นโครงงานที่จะช่วยปลุกความสนใจและสร้างความเข้าใจในด้านเทคโนโลยี ai รวมถึงด้านวิทยาศาสตร์ข้อมูล โดยมีผู้สนับสนุนรายใหญ่มากมายนักเรียนที่ได้รับการศึกษาจากโครงการ ai builders จนจบนั้นสร้างความโดดเด่นในการสมัครเข้าเรียนในระดับอุดมศึกษา จากการนำทักษะต่างๆ ที่ได้ศึกษาในโครงการ ai builders นำไปต่อยอดสู่งานวิจัยและผลงานของตนเองด้วยเหตุนี้ผมจึงมีความประสงค์อย่างมากในการเข้าไปศึกษาในโครงการ ai builders เพื่อพัฒนาทักษะและความเข้าใจเกี่ยวกับด้าน ai เพื่อนำไปต่อยอดสู่อนาคตและความฝันของผม<br><br>\n    ","date":"31-7-24","title":"Sheet music detection player","builder":"ปริญว์พัศย์ ลาภเจริญพร(อกัส)","builder_info":"เตรียมอุดมศึกษาพัฒนาการสุวรรณภูมิ / กรุงเทพมหานคร","thumbnail":"/images/2024/26/01.png","links":{"github":"https://github.com/Emeep/Sheet-Music-Detection-Player","facebook":"","blog":"https://medium.com/@parinlarp49/sheet-music-detection-player-%E0%B9%84%E0%B8%A1%E0%B9%88%E0%B8%A3%E0%B8%B9%E0%B9%89%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%99%E0%B9%84%E0%B8%87-%E0%B9%80%E0%B8%A3%E0%B8%B2%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%99%E0%B9%83%E0%B8%AB%E0%B9%89%E0%B8%9F%E0%B8%B1%E0%B8%87-d1b0cb9bff20"}}},"__N_SSG":true}