{"pageProps":{"postData":{"id":"102-pimthaigans","content":"\n![image](/images/2023/102/01.jpg)\n\n- โมเดลสร้างฟอนต์ลายมือภาษาไทยด้วย generative adversarial network เพื่อให้ได้ฟอนต์ที่สดใหม่ สไตล์ไม่เหมือนใคร\n- ชุดข้อมูลรวบรวมจาก google fonts และเว็ปฟอนต์ขวัญใจคนไทย thaifaces และ ฟอนต์.คอม; เรียนรู้ว่าฟอนต์ภาษาไทยนั้นนอกจากพยัญชนะ 44 ตัว สระมี 16 ตัว วรรณยุกต์ 5 และ ตัวเลขภาษาไทยอีก 10 ตัว แล้วยังมีตัวอักษรลับ(?)อีก 13 ตัว!!\n- การเปลี่ยนฟอนต์เป็นรูปภาพเพื่อฝึกสอนโมเดลพบปัญหาสระ-วรรณยุกต์บางตัวไม่อยู่ตรงกลางรูปภาพจึงต้องเขียนกฎเปลี่ยนตำแหน่งเล็กน้อย\n- ได้เป็นชุดข้อมูล 39,600 รูปภาพ 442 รูปแบบต่อสไตล์\n- แก้ปัญหา model collapse ด้วยการเพิ่ม iteration ในการเทรนไปเป็น8 โมเดล (เทรนโมเดลละ 2 ชั่วโมง) แทน\n- ข้อสังเกต loss function ของโมเดล discriminator ทายยากสำหรับตัวอักษรที่คล้ายๆกัน เช่น พ/ผ\n- ยังมีปัญหาบางตัวที่บางครั้ง model สร้างรูปฟอนต์ ออกมาแล้วมันบางสุดๆบางมากๆจนแถบไม่เห็น หรือ บางที่อาจไหลเกือบออกจอซึ่งมีจำนวนไม่มาก ทั้งนี้อาจจะต้องแก้ด้วยการสร้างชุดข้อมูลให้มากขึ้น แก้น้ำหนัก และตำแหน่งต่อไป\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> ผมได้รับการแนะนำมาจากรุ่นพี่ที่ผมรู้จัก รุ่นพี่ได้บอกเรื่องของกิจกรรมภายในที่เป็นการทำโครงงาน ทำโปรเจค และอื่นๆ เนื่องจากผมทำโครงงานด้านนี้อยู่แล้วผมจึงสนใจมาก และ การได้เข้าร่วมโครงการจะทำให้ผมนำความรู้ทั้งเรื่อง ai, computer หรือ การทำงานเป็นทีมการวางแผนงานต่างๆได้ดียื่งขึ้นครับสำหรับผมแล้วผมสนใจในด้านคอมพิวเตอร์มาตั้งแต่ ม.ต้น เรียนได้ว่าเป็นpassion เลย ตอน ม.ปลายผมจึงได้เริ่มทำโครงงานคอมพืวเตอร์แล้วพบว่า คอมพิวเตอร์ไม่ใช้แค่การเขียนโปรแกรม มันยังมี field ต่าๆเยอะมากหมายแต่สิ่งที่ผมสนใจมากที่สุดคิอaiสำหรับผมแล้ว ai เป็นอนาคตของพวกเราครับ สำหรับผมแล้ว ผมชื่นชอบมากๆครับ ตอน ม ปลาย ผมได้ทำโครงงาน com sci ทำให้ผมได้รู้พื้นฐานของ ai เช่นการทำ data prep data augmentation และ metrics and scoring ในด้าน image classification สิ่งที่ผมทำมาผมรู้สึก enjoy กับการนั่งอ่าน paper หรือ งานวิจัยต่างๆ สนุกที่ได้ทดลองทำมันครับ!\n    ","date":"31-7-24","title":"pimthaigans","builder":"Supawit Marayat","builder_info":"มัธยมศึกษาปีที่ 5.0 -- เชียงราย","thumbnail":"/images/2023/102/01.jpg","links":{"github":"https://github.com/Beamlnwza/pimthaigans","facebook":"https://www.facebook.com/aibuildersx/posts/pfbid0RQL33TVwSdGyiYrxPvKrPXw19GBtMHvxBKz1xBjmKRhcRfYgsfKiSnZbtQTc1Nrnl","blog":"https://medium.com/@supawitmarayat/pimthaigans-an-model-try-to-synthesis-thai-typo-f19a2e7d0bce"}}},"__N_SSG":true}