{"pageProps":{"postData":{"id":"105-pytorch-thai-food-image-classification","content":"\n![image](/images/2023/105/01.jpg)\n    \n- โมเดลจำแนกชนิดอาหารไทย 54 ชนิดจากรูปภาพด้วย resnet\n- แรงบันดาลใจเกิดจากการแก้ปัญหาอาหารไทยที่หน้าตาคล้ายๆกัน แม้แต่คนไทยก็เรียกไม่ถูก ชาวต่างชาติยิ่งไม่ต้องพูดถึง\n- รวบรวมชุดข้อมูลผ่าน duckduckgo image search API ชนิดละ 200 รูป; ทำความสะอาดด้วยโค้ดและด้วยตาเปล่า แบ่งข้อมูลเป็น train-valid-test ด้วยสัดส่วน 70:15:15\n- โมเดลที่ทำได้ดีที่สุดที่ความแม่นยำ 70% เทียบกับมนุษย์ที่ 76% คือการเทรน resnet34 ด้วยจำนวน epoch เป็น 5 เท่าของ resnet50\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> ส่วนตัวผมต้องการพัฒนาทักษะและความรู้ทางด้าน ai โดยโครงการ ai builder ก็ตอบโจทย์ผมเป็นอย่างมากเพราะเป็นพื้นที่ที่เต็มไปด้วยความท้าทาย และโอกาสในการเรียนรู้และพัฒนาตนเองอย่างต่อเนื่องเพราะจะได้เจอกับผู้เชี่ยวชาญทางด้าน ai หรือคนที่มีความสนใจในด้านเดียวกันเพื่อเเลกเปลี่ยนความรู้เเละประสบการณ์ให้กันเเละกันครับ ซึ่งผมจะนําความรู้ที่ได้จากการเข้าร่วมโครงการนี้ นําไปต่อยอดกับโปรเจคโรงเรียน หรือ งานเเข่งอื่นๆครับเมื่อก่อนผมเป็นคนสนใจด้านหุ่นยนต์ หรือพวกฮาร์ดเเวร์สะเป็นส่วนใหญ่ เเต่เมื่อผมได้มีโอกาสเรียนเกี่ยวกับ ai จากที่โรงเรียนก็ทําให้ผมรู้สึกสนใจทางด้านนี้ขึ้นมาครับ ผมพอจะรู้หลักการเขียนภาษา python อยู่บ้าง เเละพอที่จะรู้หลักการทํางานของmachine learning model บางตัวมาบ้างเเล้ว เเต่ผมอยากที่จะเรียนรู้การสร้าง ai เพิ่มเติม ผมเลยอยากเข้าโครงการนี้เพื่อที่จะรู้กระบวนสร้าง ai เช่น วิธีการดึง dataset จากเว็ปไซต์ หรือ การดึงข้อมูลรูปภาพ เพื่อที่จะสร้างai ขึ้นมา ผมอยากให้ทางโครงการได้ลองเปิดโอกาสให้ผมได้เเสดงความสามารถของผมด้วยครับ ผมสัญญาว่าจะทําให้ดีที่สุดครับ\n    ","date":"31-7-24","title":"Pytorch Thai food image classification","builder":"Saktanuth Praditukrit","builder_info":"มัธยมศึกษาปีที่ 5.0 -- สงขลา","thumbnail":"/images/2023/105/01.jpg","links":{"github":"https://github.com/SaktanuthPeak/AiBuilder-Deploy","facebook":"https://www.facebook.com/aibuildersx/posts/pfbid0F8v5RkKmp3Y7peTqisjmrJRhTwVS5ztmF8dUxBedEw8UcQ7Bz42rDjGas536MwG6l","blog":"https://medium.com/@thanakrit.5122548/3-data-collection-and-cleaning-การเก็บและทำความสะอาดข้อมูล-ba46a9ecd055"}}},"__N_SSG":true}