{"pageProps":{"postData":{"id":"107-dog-emotions","content":"\n![image](/images/2023/107/01.jpg)\n\n    \n- โมเดลจำแนกอารมณ์สุนัขจากภาพ แรงบันดาลใจจากคนรอบตัวโดนสุนัขทำร้ายจากการไปพยามเล่นด้วยตอนสุนัขอารมณ์ไม่ดี\n- ใช้ชุดข้อมูลอารมณ์ angry, happy, relaxed และ sad 1,000 ภาพจาก danielshanbalico/dog-emotion และทำการคัดเลือกรูปที่ไม่เกี่ยวข้องออกเหลือประมาณอารมณ์ละ 900 ภาพ; เพิ่ม unknown ได้แก่รูปภาพอื่นๆ เช่น ภาพทิวทัศน์ ภาพคน หรือภาพอื่นๆ ที่ไม่ใช่สุนัข อีก 900 ภาพจาก danielshanbalico/dog-vs-not-dog เพื่อป้องกันโมเดลทายมั่วกรณีไม่ใช่รูปสุนัข\n- แบ่ง train-valid-test split ที่ 80/10/10\n- ทดสอบการทำ image augmentation หลากหลายรูปแบบ ค้นพบว่า squish resize และค่าตั้งต้นของ fastai ทำได้ดีที่สุด\n- เปรียบเทียบสถาปัตยกรรม resnet34, resnet50, vgg16, และ densenet201 ปรากฎว่า resnet34 ได้ความแม่นยำสูงที่สุด\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> ต้องการพัฒนาตนเอง หาความรู้และประสบการณ์ใหม่ๆ สะสมความรู้ เพื่อในอนาคตจะสามารถนำความรู้ที่มีมาช่วยคนที่เรารักและเพื่อนมนุษย์อีกมากมายได้ดิฉันมีความตั้งใจและมุ่งมั่นที่จะเรียนรู้และฝึกฝนเป็นอย่างมากเพื่อที่จะสามารถนำความรู้ไปใช้ให้เกิดประโยชน์แก่ผู้คนได้มากที่สุด แม่ของดิฉันเป็นผู้ป่วยโรคไตทำให้ดิฉันได้เห็นความยากลำบากในการเลือกรับประทานอาหารเป็นอย่างมาก ทุกครั้งก่อนคุณแม่จะเลือกรับประทานอาหารต้องคอยหาข้อมูลก่อนเสมอว่าในอาหารเมนูนี้มีส่วนผสมอะไรบ้างและมีสารอาหารที่ส่งผลกระทบต่อไตหรือไม่ อาหารที่รับประทานบ่อยคุณแม่ก็จะจำได้แต่อาหารบนโลกนี้ไม่ได้มีแค่ 10-20 อย่าง แต่มีเป็นร้อยเป็นพัน เป็นไปไม่ได้เลยที่คนคนนึงจะสามารถจำได้หมด ดิฉันจึงเกิดแรงบันดาลใจที่จะนำเทคโลโลยีมาช่วยคุณแม่และผู้ป่วยโรคไตทุกคน\n    ","date":"31-7-24","title":"Dog emotions","builder":"Thirada Thomnam","builder_info":"มัธยมศึกษาปีที่ 5.0 -- กำแพงเพชร","thumbnail":"/images/2023/107/01.jpg","links":{"github":"https://github.com/pim3567/Dog-emotions","facebook":"https://www.facebook.com/aibuildersx/posts/pfbid0bTWbDhnSw7Q9yAJ3HPBmxRkDm142eGAT7AMQEuvCZPGirc6JYrUmQS3SzEWdrMfql","blog":"https://medium.com/@thirada.pim567/dog-emotions-67000abcce08"}}},"__N_SSG":true}