{"pageProps":{"postData":{"id":"73-mediapipe","content":"\n![image](/images/2023/73/01.jpg)\n    \n- สร้างชุดข้อมูลขึ้นมาเองทั้งหมดเป็นวีดีโอความยาว 30 เฟรม ทั้งหมด 30 คลิปต่อหนึ่งคำ ครอบคลุมคำศัพท์110 คำ รวม 30 * 110 = 3300 วีดีโอ; “ใช่ครับผมนั่งถ่ายตัวเอง 3300 คลิป” -builder\n- วิดีโอถ่ายแบบครึ่งตัว หากคำไหนใช้มือแค่ข้างเดียวจะใช้มือขวา; คำที่เลือกมาเทรนโมเดลเป็นคำที่ใช้บ่อยในชีวิตประจำวัน\n- ใช้ MediaPipe สกัด keypoints ของแต่ละคำจากภาพ จากนั้นนำ keypoints ไปเทรนด้วย LSTM\n- โมเดลทำนาย 45 และ 110 คำทำนายคำศัพย์จากวิดีโอได้โดยแทบไม่มีข้อผิดพลาด\n- งานถูกพัฒนาบน Asus Vivobook รุ่น X556UQ-XX1342T ราคา 20,000 บาทอายุ 6 ปีที่ยังสามารถรันโมเดลบน Jupyter Notebook ได้โดยที่ไม่ระเบิดไปซะก่อน\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> ปัจจุบัน ai เข้ามามีส่วนเกี่ยวข้องอย่างมากในการแก้ปัญหาสำคัญต่างๆและพัฒนาความก้าวหน้าทางเทคโนโลยีในโลกการที่ผมได้มีประสบการณ์และความรู้ในการทำ ai จะช่วยให้ผมมีวิสัยทัศน์มากขึ้นในการนำ ai มาใช้ในการแก้ real-world problems เพื่อนำใช้ให้เกิดประโยชน์แก่สังคมต่อไปในอนาคตซึ่งจากการที่ผมได้เห็นผลงานจากผู้ที่เข้าร่วมค่ายนี้ ผมเห็นว่ามันเป็นอะไรที่เจ๋งมากๆ และตรงกับความต้องการของผม นอกจากนี้ผมยังได้มีโอกาสทำความรู้จัก และพูดคุยกับผู้ที่เคยเข้าร่วมค่ายนี้ในงานต่างๆ ซึ่งทุกคนนั้นเก่งมากๆ และบางคนก็ได้เป็นแรงบันดาลใจให้ผมในการพัฒนาโครงงานต่างๆ การที่ผมได้มีโอกาสเข้าร่วมโครงการนี้ จะทำให้ผมได้เข้าไปอยู่ใน learning environment ที่จะทำให้ผมมีการพัฒนาอยู่ตลอดเวลา เพราะมีผู้เชี่ยวชาญคอยเป็น mentor ให้คำแนะนำและความรู้มากมายอยู่ตลอด รวมทั้งยังมีโอกาสได้ทำความรู้จักกับเพื่อนเก่งๆมากมายที่มีความสนใจในเรื่อง ai เหมือนกัน\n","date":"31-7-24","title":"โมเดลการแปลภาษามือไทยด้วย MediaPipe","builder":"Arucha Khematharonon","builder_info":"มัธยมศึกษาปีที่ 6.0 -- กรุงเทพมหานคร","thumbnail":"/images/2023/73/01.jpg","links":{"github":"https://github.com/Annerez/Mediapipe_ThaiHandSign","facebook":"https://www.facebook.com/aibuildersx/posts/pfbid0gKbo1CGJv1miTNfrKUby7hgQ7kYAGX6KsTGsUDTWxDvanubm2e5Sc7m2h87MRJvhl","blog":"https://medium.com/@aruchakhem/thai-hand-sign-detection-using-mediapipe-6683cc711e91"}}},"__N_SSG":true}