{"pageProps":{"postData":{"id":"78-sitting-posture-estimate","content":"\n![image](/images/2023/78/01.jpg)\n\n- โมเดลตรวจจำแนกท่านั่งที่ถูกและผิดวิธี เพื่อป้องกันอาการปวดหลัง ปวดคอ ปวดบ่า สารพัดปัญหาที่ใคร ๆ ไม่ว่าจะวัยหนุ่มสาว วัยทำงาน หรือวัยชราก็ต้องเคยเจอ\n- จากแบบสำรวจ 30 คน พบว่าคนส่วนใหญ่สามารถจำแนกท่านั่งที่ถูกและผิดได้ด้วยความแม่นยำประมาณ 80%; แต่ในชีวิตจริงคงไม่มีใครมานั่งจ้องว่าท่านั่งใครถูกหรือผิดตลอดเวลา การสร้างโมเดลที่มีความแม่นยำใกล้เคียงแต่ทำงานได้อัตโนมัติจึงสำคัญ\n- เก็บข้อมูลจากโมเดลสร้างภาพและรูปภาพในอินเตอร์เน็ต คัดเลือกด้วยตาจนได้ท่านั่งที่ถูกและผิดอย่างละประมาณ 50 รูป; แบ่งเป็น train-validation-test ด้วยอัตราส่วน 80/10/10\n- ใช้ resnet34 จำแนกรูปภาพได้ความแม่นยำ 77% บน test set\n- ใช้ image segmentation จาก MediaPipe ทำการตัด background เพื่อเพิ่มความแม่นยำในการใช้งานจริง\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> ผมอยากจะทำโครงงานเพื่อแก้ปัญหาให้ผู้คน พัฒนาตัวเอง รวมถึง เอาผลงานนั้นไปยื่นพอร์ตเข้ามหาวิทยาลัย แล้วตัวผมเองก็ยังไม่เคยได้ลองทำในเกี่ยวกับ ai เลย ถ้าผมได้เข้าร่วมโครงการนี้ ก็จะเป็นโครงงานเกี่ยวกับ ai โครงงานแรกของผมเพราะการเรียนและการค้นหาตัวเองที่ดีที่สุดคือการลงมือทำ ซึ่งผมก็ไม่รู้ว่าชอบในด้าน ai นี้มั้ย ซึ่งถ้าได้ทำก็คงรู้ว่าชอบหรือไม่ จะเป็นการค้นพบตัวเองในด้านนี้เร็วขึ้น และพัฒนาไปได้เร็วกว่าที่จะลงมือทำคนเดียวโดยที่ไม่มีผู้มีประสบการณ์มาสอนให้คำแนะนำตอนผมไปเข้าค่ายที่ tobeit'66 ที่ kmitl ผมได้เจอกับพี่คนนึงคือพี่ไกด์ เขาเข้าร่วม ai builder ของปีที่แล้ว ทำให้แนะนำผมรู้จักโครงการนี้ ซึ่งผมรู้สึกสนใจโครงการนี้มากๆส่วนตัวผมเคยเข้าร่วมค่ายสอวน.คอมถึงค่าย 2 ซึ่งทำให้มีความเข้าใจในอัลกอริทึม ร่วมทำเว็บไซต์กับรุ่นพี่ให้โรงเรียนในวันวาเลนไทน์ โดยที่ผมทำในส่วน front-end และเป็นคน hosting เว็บไซต์ขึ้นบน firebase เข้าถึงได้จาก https://ssp-valantine.web.app/ เคยเข้าร่วมค่ายworld of data camp เป็นค่ายของม.ธรรมศาสตร์ ซึ่งทำให้มีความเข้าใจในเรื่อง data science และ sql ในระดับนึง\n","date":"31-7-24","title":"Sitting Posture Estimate","builder":"Aritat Suriyapattanapong","builder_info":"มัธยมศึกษาปีที่ 4.0 -- สมุทรปราการ","thumbnail":"/images/2023/78/01.jpg","links":{"github":"https://github.com/FarAritat/Sitting-Poseture-Estimate","facebook":"https://www.facebook.com/aibuildersx/posts/pfbid0fg9C8v2iKhCuCSzdQPTBb5TfDvhq5LjueRRpiSahKingxt2oJSCqFUhHJn385NnJl","blog":"https://medium.com/@aritatsuriyapattanapong/sitting-posture-estimate-ccb9814e2aa9"}}},"__N_SSG":true}