{"pageProps":{"postData":{"id":"83-woodsight","content":"\n![image](/images/2023/83/01.jpg)\n\n- โมเดลแยกชนิดวัสดุไม้ (ปูพื้น-กำแพง) จากรูปภาพ แรงบันดาลใจมาจากงานของคุณแม่ที่ต้องเลือกชนิดวัสดุไม้อยู่บ่อยๆ\n- เก็บข้อมูลวัสดุไม้ที่ใช้ประจำโดยสถาปนิก 9 ชนิดคือ Ash, Beech, Birch, Cherry, Maple, Oak, Pine, Teak, และ Walnut\n- เก็บข้อมูลจาก Google Image Search โดยการ scrape ด้วย Serpapi; ทำความสะอาดลิ้งค์ที่ใช้ไม่ได้,crop รูปที่ไม่ได้มีแต่วัสดุไม้ ทั้งหมดแล้วจาก 9,000 รูปเหลือ 3,885 รูปสำหรับพัฒนาโมเดล\n- สำหรับ validation set เริ่มแรกวางแผนจะถ่ายรูปไม้จริงจาก IKEA แต่เกิดปัญหากล้องปรับแสงทำให้สีเพื้ยนจึงเปลี่ยนไปใช้ 10% ของชุดข้อมูลทั้งหมดที่ได้จากอินเตอร์เน็ตเป็น validation set แทน\n- เทรนโมเดด้วย resnet34 โดยแบ่งเป็น 1) เทรนด้วยข้อมูลก่อนทำความสะอาด-ทดสอบด้วยรูปถ่ายจริง 2) เทรนด้วยข้อมูลที่ทำความสะอาดแล้ว-ทุดสอบด้วยรูปถ่ายจริง 3) เทรนด้วยข้อมูลก่อนทำความสะอาด-ทดสอบด้วยรูปที่สุ่มออกมา 4) เทรนด้วยข้อมูลที่ทำความสะอาดแล้ว-ทดสอบด้วยรูปที่สุ่มออกมา\n- เห็นได้ว่าการทำความสะอาดข้อมูลมีผลทำให้ความแม่นยำเพิ่มขึ้นประมาณ 15% แต่โมเดลยังทำได้ไม่ดีกับรูปถ่ายจริง (ความแม่นยำประมาณ 20%) เทียบกับรูปที่สุ่มออกมา (ความแม่นยำประมาณ 60%)\n- ประเมินความผิดพลาดพบว่าเกิดจากวัสดุไม้บางกลุ่มที่มีสีและลายใกล้เคียงกันมาก เช่น Dark Oak, Walnut และ Cherry\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> ผมได้แรงบันดาลใจในด้าน coding จากเกมมาตั้งแต่เด็กๆ ชอบสร้างเกมมากกก แต่ก็เห็นว่าตัวเองไม่เก่งในการcoding สดๆ ถนัดแต่ drag and drop เลยอยากพัฒนาเรื่อง coding และผมสนใจในด้านai มากเหมือนกันหลังจากได้เห็น ai ต่างๆใน internet ผมสงสัยมากว่าพวก deep learning กับ machine learning เขาทำกันยังไง เคยลองหาข้อมูลดูแต่ก็ยังเข้าใจได้ไม่มาก ผมเลยอยากเรียนรู้หลักการต่างๆจากพี่ๆที่เก่งๆในโปรแกรมนี้ และลองทำโปรเจค ai ด้วยตัวเองซึ่งก็น่าจะสนุกและสามารถต่อยอดให้กับการเรียนระดับมหาวิทยาลัยของผมได้ ครับมีแรงบันดาลใจ coding มาจากเกม, และแรงบันดาลใจ ai มาจาก ai ต่างๆเช่น midjourney, dall e, chatgpt และก็ content ai ต่างๆในช่อง two minute papers เขียนโปรแกรมมาตั้งแต่ ประถม ส่วนใหญ่เป็น (drag and drop) เคยทำ line chat bot ให้ ttb (ธนาคาร) ตอน ม.4 สำหรับการบริหารภายในโดยใช้ dialogflow เคยเข้าค่ายสร้างเกมด้วย unity ตอน ม.1 มีโปรเจคสร้างเกม เป็น senior project ของ รร. อื่นๆ : ชอบวาดรูป, ทำ animation, graphic design, ux + ui design, web design, เล่นเปตอง\n    ","date":"31-7-24","title":"WoodSight","builder":"Chetphisuth Tongpa","builder_info":"มัธยมศึกษาปีที่ 5.0 -- กรุงเทพมหานคร","thumbnail":"/images/2023/83/01.jpg","links":{"github":"https://github.com/Keenlol/WoodSight","facebook":"https://www.facebook.com/aibuildersx/posts/pfbid037muHisWf2GBbUeYSibHXbyYhJbMpXT9ufaydjcXwJHamFej6EwbQdEhQCUrEPxeQl","blog":"https://medium.com/@Keenlol/woodsight-a-wood-texture-classification-model-677390f64a7a"}}},"__N_SSG":true}