{"pageProps":{"postData":{"id":"91-t2e-vocabulary-exam-generator","content":"\n![image](/images/2023/91/01.jpg)\n\n- โมเดลสร้างโจทย์ถามความหมายคำศัพท์ภาษาอังกฤษในบริบทที่ให้มาด้วยการปรับจูน bart-large-mnli; แรงบันดาลใจจากประสบการณ์ช่วยครูออกข้อสอบ ทำให้อยากได้โมเดลที่สร้างโจทย์ให้มีความยากเหมาะกับความสามารถของผู้เรียน (CEFR)\n- วิธีการใช้งานคือให้ผู้ใช้ใส่บริบทเป็นบทความสั้นๆเข้ามาพร้อมกับระดับความยาก CEFR จากนั้นระบบจะทำการสร้างคำถาม ตัวเลือก และคำตอบที่ถูกต้องให้ตรงกับบริบทและความยาก\n- ค้นหาพจนานุกรมคำศัพท์ CEFR จากหลากหลายที่มา เช่น pdf บนอินเตอร์เน็ต,อีเมลไปขอมหาวิทยาลัยที่ตีพิมพ์, ติดต่อโรงเรียน แต่ไม่ประสบความสำเร็จเนื่องจากข้อจำกัดทางกฎหมาย; สุดท้ายได้รับคำแนะนำจาก mentor ให้ใช้ WordNet จาก NLTK และ csv ปริศนาจากคนในอินเตอร์เน็ตมารวมกันได้ประมาณ 120,000 ข้อความ\n- ใช้ spaCy ทำ POS tagging เพื่อกรองให้เหลือแค่คำศัพท์ CEFR และแยกตามลำดับความยาก\n- วัดผลโดยการทำ natural language inference ของคู่บริบท/คำถามกับตัวเลือกคำตอบ\n- finetuning ทำให้ความแม่นจำสูงขึ้นจาก 56% เป็น 75%\n- ตรวจสอบความสามารถของโมเดลว่าตอบถูกในคำศัพท์ที่มี part-of-speech ประเภทใดเป็นพิเศษหรือไม่\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> ผมสนใจในด้านคอมพิวเตอร์และเทคโนโลยีตั้งแต่เด็กอยู่แล้ว พอโตมาได้ลองเขียนโค้ดจริงๆดูก็ติดใจและเอามาเป็นงานอดิเรกมาแล้ว 2 ปี ได้เขียน c, python, sql, html, css ได้โค้ดเว็บไซต์ตัวเอง 2 เว็บ ได้ทำโปรเจคให้โรงเรียน ได้เรียนรู้เรื่อง ux/ui design และได้รับเข้าทำโปรเจคของ start-up ที่ชื่อว่า viabus ได้เรียนรู้ดีไซน์และขั้นตอนมากมายในส่วนของการสร้าง product และ service และตอนนี้ผมสนใจทางด้าน data science เลยคิดว่าโครงการนี้น่าจะเป็นก้าวสำคัญที่ทำให้ได้เรียนรู้การทำงานกับข้อมูลและการนำข้อมูลไปประยุกต์ใช้อย่างลึกและเข้มข้นขึ้น สรุปง่ายๆคืออยากเรียนศาสตร์ต่างๆใน computer science ให้รู้จริงและนำไปทำโปรเจคที่มีคุณค่าต่อสังคมได้ครับจากในอดีตของผมที่มีความรู้เรื่อง html, css ผมก็ได้นำความรู้นี้ไปทำโปรเจคให้โรงเรียน สิ่งที่ผมทำคือเว็บไซต์ที่ทำให้นักเรียนสามารถเข้าไปเช็คตารางเรียนเองได้ง่ายๆเนื่องจากโรงเรียนผมตารางสอนเปลี่ยนทุกสัปดาห์ หลังจากนั้นผมได้เรียนรู้ ux/ui design ผมก็ฝึกตัวเองจนมาความสามารถเข้าไปทำ intern ใน start-up ที่ชื่อว่า viabus และได้สร้าง product ที่ช่วยยกระดับคุณภาพชีวิตคนใช้รถเมล์ในประเทศไทย เป็นการนำความรู้ความสามารถไปใช้ประโยชน์โดยการช่วยเหลือสังคม ผมก็คิดว่าถ้าผมมีความรู้เกี่ยวกับ data science มากขึ้น ผมจะสามารถเอาไปปรับประยุกต์เพื่อนำไปสร้างคุณค่าให้สังคมรอบข้างเช่นทำโปรเจคให้โรงเรียน หรือเข้าไปทำโปรเจคใน start-up และทำประโยชน์เพื่อสังคมเหมือนที่เคยทำมาได้เช่นเดียวกัน และโครงการนี้ก็เป็นฟันเฟืองชิ้นสำคัญในการทำให้ผมบรรลุเป้าหมายนั้นครับ\n    ","date":"31-7-24","title":"T2E Vocabulary Exam Generator","builder":"Nutnornont Chamadol","builder_info":"มัธยมศึกษาปีที่ 5.0 -- กรุงเทพมหานคร","thumbnail":"/images/2023/91/01.jpg","links":{"github":"https://github.com/JollypopChannel/AI-Builders_Code-Resources-shared","facebook":"https://www.facebook.com/aibuildersx/posts/pfbid02grcfgmMEyfRTW9jwy5sHTFN4vyiDYuGnhQYH98WRTMbzKhyAvi1mLE94iJd1PWLwl","blog":"https://medium.com/@mario-world/text-to-exam-generator-nlp-using-machine-learning-71da8dd93a4a"}}},"__N_SSG":true}