{"pageProps":{"postData":{"id":"98-virtual-coding-mentor","content":"\n![image](/images/2023/98/01.jpg)\n\n- โมเดลสร้างโจทย์เขียนโปรแกรมด้วย language model; แรงบันดาลใจจากการอยากได้โจทย์ที่หลากหลายและเหมาะกับความสามารถของตัวเอง\n- ชุดข้อมูล Scrape จาก geeksforgeeks เป็นโจทย์ภาษา Python 2,000 ตัวอย่าง\n- Finetune โมเดล SantaCoder-1B ที่ถูกเทรนมาจากโค้ดล้วนๆ ให้สามารถรับคำสั่งเป็นภาษาธรรมชาติได้ด้วย\n- ได้ผลไม่ต่างจากpretrained model เท่าในนักในเชิงperplexity; แสดงให้เห็นว่าการประเมิน generative models ต้องใช้ benchmark ที่ดีกว่า perplexity เพียงอย่างเดียว\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> ผมสนใจด้านเทคโนโลยีมาตั้งแต่ตอนเด็กแล้วครับเทรนด์เทคโนโลยีไหนมาแรง มันคืออะไร? ทำงานยังไง? ผมมักจะสงสัยและตั้งคำถามทุกครั้งจนติดเป็นนิสัย ความสนใจในด้าน ai ของผมเริ่มจากเมื่อตอนผมอยู่ม.4ตอนนั้นผมก็สงสัยครับว่า ai คืออะไร? มันรู้ได้ยังไงว่าเราชอบฟังเพลงแบบไหน? ช่วยเราทำงานได้ยังไง? มีคำถามผุดขึ้นมากมาย ผมจึงเริ่มศึกษาเรื่อง ai ครับ ยิ่งศึกษาผมก็ยิ่งสนใจและอยากรู้เพิ่มมากขึ้น ผมพบว่านี่คือ way of life ของผมและหลงใหลในเส้นทางนี้ ผมได้รู้จักโครงการ ai builders เมื่อปีที่แล้วและถึงจะไม่ผ่านการคัดเลือกในครั้งก่อน ผมก็คิดมาตลอดครับว่า “ต้องทำยังไงถึงจะเข้าโครงการนี้ได้” ซึ่งถึงผมจะศึกษาด้วยตัวเองมาแล้วบ้าง แต่ผมก็ยังขาดความรู้และประสบการณ์ ผมยังต้องการคำแนะนำ อยากได้ลองทำอะไรใหม่ๆ อยากเจอเพื่อนที่สนใจในด้านเดียวกันซึ่งผมเชื่อว่าโครงการนี้จะให้การสนับสนุนและช่วยให้ผู้เข้าร่วมโครงการทุกคนได้รับประสบการณ์ที่ดีสำหรับการต่อยอดและพัฒนาตัวเองรวมถึงพัฒนาสังคมในอนาคตครับเมื่อปีที่แล้วผมได้สมัครโครงการ ai builders เหมือนกันครับ แต่ครั้งก่อนผมไม่ได้รับเลือกให้เข้าโครงการ ตอนนั้นผมคิดมาตลอดเลยครับว่า “ต้องทำยังไงถึงจะเข้าโครงการนี้ได้” ผมทบทวนตัวเองทั้งเรื่องการแก้โจทย์หรือการเขียนไอเดียโปรเจคซึ่งในปีนี้เป็นปีสุดท้ายที่ผมสามารถสมัครโครงการนี้ได้ ผมจึงขอทุ่มสุดตัวเพื่อเข้าโครงการ ai builders เช่นกันครับ\n    ","date":"31-7-24","title":"Virtual Coding Mentor","builder":"Pipatpong Chuchuai","builder_info":"มัธยมศึกษาปีที่ 6.0 -- ชลบุรี","thumbnail":"/images/2023/98/01.jpg","links":{"github":"https://github.com/nomsodcaramel/AI-Builders","facebook":"https://www.facebook.com/aibuildersx/posts/pfbid02nQEpcPQRBizAZWzK5iZJFNQGz9TZqrS1p4UkUC5bmfWKDFVWAKB1g8KP7rAcDXs2l","blog":"https://medium.com/@pipatpong.chuchuai01_21891/no-practice-assignments-no-problem-use-generative-ai-to-create-your-own-314adc74c92f"}}},"__N_SSG":true}