{"pageProps":{"postData":{"id":"15-thawat-khumphaen","content":"\n![image](/images/2024/15/01.png)\n\n- แรงบันดาลใจ: แรงบันดาลใจของผมมาจากสิ่งที่ผมได้เจอมากับตัวเอง จากการที่ผมมีฟันคุด 4 ซี่ ซึ่ง 1 ในนั้นเป็นฟันคุด มันไปเบียดฟันข้างๆทำให้ฟันกรามที่โดนเบียดผุไปด้วย ผมรู้สึกเสียใจมากที่ต้องสูญเสียฟันแท้ตั้งแต่ตอนอายุ 18 ปี แต่มันก็ทำให้ผมได้เห็นวิธีการทำงานของหมอฟัน ตั้งแต่การวินิจฉัยด้วยตาเปล่าจากภายนอก การ X-rays ฟันทั้งแบบ ฺBitewing X-ray(แบบเฉพพาะซี่) และ Panoramic X-rays(แบบเห็นทั้งฟัน ไซนัส และกระดูกขากรรไกร) ขั้นตอนในการถอนฟันคุด การอุดฟัน รวมถึงการนัดเช็คระ15ยะฟันข้างๆฟันคุดว่ามีรอยผุมั้ย \n- เป้าหมาย: ผมอยากที่จะทำโครงงานนี้ขึ้นมาเพื่อช่วยให้คุณหมอทำงานได้สะดวกขึ้นและช่วยตรวจสอบฟันซี่อื่นๆที่อาจจะไม่ได้เกี่ยวกับบริเวณฟันที่มีปัญหา เพื่อเพิ่มประสิทธิภาพในการวินิจฉัย\n- dataset จาก kaggle(Teeth Segmentation on dental X-ray images) โดยข้างใน Dataset นี้ จะมี Image และ Mask และ Json file อยู่อย่างละ 598 file\n- จากการนำ Teeth Segmentation on dental X-ray images dataset มาใช้ในการเทรนโมเดล Res-Unet โดยใช้ Adam optimizer, learning rate = 0.000006, batch size = 5, ไม่มีการ Flip หรือ Rotation ภาพ เมื่อนำมา test จะได้ Dice score = 0.9039711356163025\n- future plan คือการทำให้โมเดลสามารถตรวจจับฟันผุ และฟันคุดได้\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> เนื่องจากผมเคยสมัคร ai builder มาแล้วครั้งนึงในปีที่แล้วซึ่ง<strong> <u>ผมไม่ติด</u></strong> ทำให้ผมได้พัฒนาตัวเองให้เก่งขึ้นจากการเรียนรู้ด้วยตนเอง และจากการเข้าค่ายต่างๆ ผมเห็นว่าทางโครงการรับนักเรียนที่จบม.6ในปีนี้ด้วย ผมจึงได้สมัครเข้ามา เป้าหมายของผมคือการสร้าง ai ที่มีประโยชน์ต่อสังคม ผมจึงได้สมัครเข้าร่วมโครงการนี้เพื่อหาความรู้และพัฒนาทักษะในการทำ ai เนื่องจากผมได้ติดมหาวิทยาลัยในสาขาวิศวกรรมหุ่นยนต์และระบบอัตโนมัติ ผมจึงอยากใช้เวลาในช่วงปิดเทอมนี้พัฒนาตัวเองให้เก่งขึ้นอีก เพื่อจะได้นำ ai ไปประยุกต์ใช้กับงานด้านหุ่นยนต์ ผมยังเป็น beginner ในการทำ ai ผมจึงอยากได้ mentor ที่คอยเป็นที่ปรึกษาให้ผม ซึ่งโครงการนี้มี mentor คอยให้คำปรึกษา ผมคิดว่าการมี mentor และการลงมือทำ จะทำให้ผมได้รู้จัก ai มากขึ้น และคำแนะนำจาก mentor จะมีประโยชน์กับตัวผมเป็นอย่างมาก<strong> ผมจะมุ่งมั่น ตั้งใจ และรับฟังคำแนะนำจาก mentor เพื่อที่จะนำความรู้ที่ได้จากโครงการ ai builder นี้มาพัฒนานาตนเอง และนำไปใช้เกิดประโยชน์ต่อสังคมให้ได้มากที่สุด สุดท้ายนี้ผมเชื่อว่า \" ai ที่ผมสร้างขึ้นมาจะสามารถช่วยเหลือสังคมและทำให้โลกใบนี้ดีขึ้นได้ \"</strong>\n    ","date":"31-7-24","title":"Teeth segmentation using Res-UNet","builder":"ธวรรธน์ คุ้มแผน(แซน)","builder_info":"สาธิตมหาวิทยาลัยราชภัฏนครปฐม / นครปฐม","thumbnail":"/images/2024/15/01.png","links":{"github":"https://github.com/SanThawat/aibuilder-deploy","facebook":"","blog":"https://medium.com/@sand32kpan/25ec1d5c7c86"}}},"__N_SSG":true}