{"pageProps":{"postData":{"id":"16-bunyaphon-chaimongkolsup","content":"\n![image](/images/2024/16/01.png)\n\n- โมเดลจำเเนกรูปภาพอัลตราซาวนด์เพื่อตรวจมะเร็งไทรอยด์ โดยใช้ข้อมูลจาก Kaggle (Algerian Ultrasound Images Thyroid Dataset : AUITD) ของโรงพยาบาลเเอลจิเรียในเมืองเซติฟ เป็นภาพจากเครื่องอัลตราซาวนด์ Toshiba Viamo , Toshiba Aplio 300 เเละ Toshiba Aplio XG\n- ได้เเรงบรรดาลใจมาจากที่ตนเองเป็นโรคเกี่ยวกับต่อมไทรอยด์\n- Benign 620 รูป , Malignant 584 รูป , Normal thyroid 171 รูป\n- Train set = 1100 , Test set = 275 (80% / 20%) ทำการจำเเนกรูปภาพว่าเป็น normal (ไทรอยด์ปกติ) , benign (เนื้องอกไม่อันตราย) หรือ malignant (เนื้องอกชนิดร้าย)\n- เเพทย์ที่ไม่ได้เชี่ยวชาญเฉพาะด้านต่อมไทรอยด์ มีความแม่นยำในการแปลผลภาพอัลตราซาวนด์ด้วยสายตาประมาณ 55–70% เเละเเพทย์ที่เชี่ยวชาญ มีความแม่นยำในการแปลผลภาพอัลตราซาวนด์ด้วยสายตาประมาณ 80–90% โดยใช้เวลาเฉลี่ย 10–20 นาที หากเป็นภาพที่ซับซ้อนก็ต้องใช้เวลานานขึ้น\n- เปรียบเทียบสถาปัตยกรรม Vision Transformer, Resnet50, VGG16 ผลปรากฎว่า Vision Transformer ได้ค่าความแม่นยำสูงที่สุด\n- โมเดลสามารถจำเเนกภาพได้ค่า f1-score อยู่ที่ 93 %\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> ตอนเด็กๆหนูเป็นคนที่ชื่นชอบหุ่นยนต์เป็นอย่างมาก มันทำให้หนูสงสัยมาตลอดว่า ทำไมสิ่งที่ไม่มีชีวิต ถึงได้สามารถเคลื่อนไหวเหมือนกับมันเป็นสิ่งมีชีวิต ทั้งที่มันเป็นเเค่เศษเหล็กเเท้ๆ หนูเลยได้ลองหาข้อมูลเพิ่ม จนได้มารู้จักกับคำว่า ai หนูได้เคยศึกษา k-nearest neighbors , decision tree , classification มาบ้างเเละก็เข้าใจเเค่งูๆปลาๆอยู่ดี จนวันนี้หนูได้รู้จักกับโครงการ ai builder เเละหนูคิดว่าโครงการนี้เเหละ ที่จะช่วยให้หนูได้เรียนรู้จนสามารถพัฒนาความสามารถของตัวเองให้เติบโตได้อย่างรวดเร็ว เเละได้รับคำเเนะนำต่างๆทั้งจากพี่ๆ mentor ta รวมถึงเพื่อนๆที่มีใจรักคอมเหมือนกัน หนูขอบคุณมากๆที่มีโครงการนี้ขึ้นมา เพราะโครงการนี้ทำให้หนูได้เห็นโปรเจคเจ๋งๆจากหลายๆคนเเละโครงการนี้ยังเเบ่งปันความรู้เจ๋งๆที่สามารถดูได้ฟรีบนยูทูป หนูซาบซึ้งมากจริงๆค่ะ สุดท้ายนี้หนูหวังว่าสักวันหนูจะมีโปรเจคของตัวเองเเสดงอยู่ที่เพจ ai builder หนูสัญญาว่าจะทำให้เต็มที่เเละนำคำเเนะนำทุกอย่างมาเเก้ไขเพื่อให้ได้ผลงานใน version ที่ดีที่สุด\n    ","date":"31-7-24","title":"Thytra (Thyroid Ultrasound Image Classification for Disease Diagnosis)","builder":"บุณยาพร ชัยมงคลทรัพย์(เบล)","builder_info":"สระบุรีวิทยาคม / สระบุรี","thumbnail":"/images/2024/16/01.png","links":{"github":"https://github.com/BunyaphonChaimongkolsup/Deploy-AIB2024-Thytra","facebook":"","blog":"https://medium.com/@bunyaphon536/thytra-thyroid-ultrasound-image-classification-for-disease-diagnosis-e26591bd1b82"}}},"__N_SSG":true}