{"pageProps":{"postData":{"id":"17-nattapong-pakdeeviboon","content":"\n![image](/images/2024/17/01.png)\n\n- สร้างTraffic law question answering เพราะว่าอยากที่รู้ข้อกฎหมายเกี่ยวกับการจราจรว่าการกระทำเเบบไหนนั้นผิดกฎหมาย \n- จะเป็นการทำ RAG (Retrieval Augment Generation) รวมกับการทำ 2 stage retrieval \n- ในการทำ RAG จะต้องมี data ที่เก็บไว้เป็นเเหล่งอ้างอิง นำเอกสารกฎหมายของพระราชบัญญิติการจราจรมาทำเป็น structure data \n- testset เป็นข้อมูลสำหรับการทดสอบที่ประกอบด้วยคำถาม 103 ข้อ ซึ่งคำถามเหล่านี้ถูกออกแบบมาเพื่อวัดประสิทธิภาพของโมเดลที่ใช้ในการตอบคำถามเกี่ยวกับกฎหมายจราจร คำถามเหล่านี้เป็นคำถามทั่วไปที่พบได้ในการจราจร\n- ทดลองกับ 3 Model ด้วยกัน 1. BM25 2. BGE-M3 3. ME5 ผลออกมาBGE M3 มีคะเเนนมากที่สุดเลยได้ศึกษาเพิ่มเติมเเละเจอการคำนวนคะเเนน 5 เเบบ 1. Dense 2. Sparse 3.Multi vector 4.Dense + Sparse 5. Dense + Sparse + Multi vector เนื่องจากทำ 2 stage retrieval ก็เลยจะเป็นที่จะต้องนำ top k passage ไปเข้า reranker โดย rerank เราจะใช้ BGE M3 reranker เเละจากนั้นส่งคำตอบไปให้ large language model \n- ข้อเสนอแนะ (เพิ่มเติม) เนื่องจากเป็นกฎหมายเลยจะมีการอัพเดทอยู่เรื่อยดังนั้นต้องรวบรวมจนถึงฉบับล่าสุด เพิ่มความเเม่นยำของการทำ retrieve ให้มีมากยิ่งขึ้น\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> ผมเป็นอีกคนนึงที่ได้เติบโตมาพร้อมกับเทคโนโลยี เท่าที่จำความได้ ผมก็ชอบสิ่งนี้ไปเเล้ว ความสนใจและความหลงใหลในเทคโนโลยีไม่เพียงแต่ปลูกฝังความคิดสร้างสรรค์และการแก้ไขปัญหาในตัวผม ในช่วงเวลาที่ผ่านมาผมได้รู้จักผู้คนที่มีความสามารถทางด้านนี้หลายๆคน เเลัวชอบสายงานเป็นอย่างมาก เเละไม่นานมานี้ผมได้รู้จักกับ ai ที่เป็นอีกสิ่งหนึ่งที่เข้ามามีผลต่อชีวิตความเป็นอยู่ของผมเป็นอย่างมาก จึงพยายามที่จะเรียนรู้ด้วยตัวเองในหัวข้อต่างๆอย่างเเละได้เรียนรู้จากรายการsuper ai engineer ss4 ที่เป็นการเรียนใน mooc ในเรื่องของ machine learning, neural network ,image processing,กับการทำ eda data เเละ data virtualization , การเขียนภาษา python&nbsp;โดยการพัฒนา ai จะเป็นอาชีพที่มีการเติบโตเป็นอย่างมากในช่วง 10 ปีข้างหน้านี้ ไม่ว่าจะเป็น machine learning engineer , data science , data engineer&nbsp;ผมอยากที่ประสบการณ์การได้โครงงานจริง เพื่อที่จะสั่งสมประสบการณ์ที่ได้ทำ ai ให้มากยิ่งขึ้น\n    ","date":"31-7-24","title":"Traffic law question answering ","builder":"ณัฐพงษ์ ภักดีวิบูลย์(รันช์)","builder_info":"นวมินทราชินูทิศ สตรีวิทยา พุทธมณฑล / กรุงเทพมหานคร","thumbnail":"/images/2024/17/01.png","links":{"github":"https://github.com/Runnies23/Traffic-law-question-answering","facebook":"","blog":"https://medium.com/@nattapongryan230707/traffic-law-question-answering-ai-builder-eda0bf121b1d"}}},"__N_SSG":true}