{"pageProps":{"postData":{"id":"23-siravit-keeratipranon","content":"\n![image](/images/2024/23/01.png)\n\n- predict Parkinson's disease จากภาพวาดรูปก้นหอย โดยเหตุผลที่เลือกทำโปรเจคนี้ เนื่องจากปัจจุบันจำนวนผู้ป่วยโรคพาร์กินสันนั้นมีแนวโน้มจะเพิ่มมากขึ้นเรื่อยๆ และอาการของโรคนี้แทบจะกระทบเกือบทุกด้านในชีวิตประจำวัน โดยอาการจะยิ่งรุนแรงหากปล่อยไว้นาน อีกทั้งในปัจจุบันโรคนี้ยังไม่มีวิธีการรักษาให้หายขาด มีแต่เพียงการรักษาตามอาการ ผมจึงคิดว่าหากเราสามารถประเมิณอาการโรคพาร์กินสันเบื้องต้น จากการวาดภาพง่ายๆ ได้ จะสามารถช่วยให้คุณภาพชีวิตของผู้ป่วยดีมากขึ้น\n- ใช้ชุดข้อมูลจาก Kaggle และ HandPD รวม 365 ภาพ (healthy 190 images, patient 175 images) โดยจากจำนวนนี้แบ่งไป test set จำนวน 20ภาพ (healthy 10 images, patient 10 images)\n- ทดลอง 5 architecture : ResNet34, ResNet50, DenseNet121, DenseNet201, VGG16 โดย VGG16 แม่นยำที่สุด\n- environment ของ dataset ที่ใช้ มี image's environment ต่างกับ image's environment ตอนใช้จริง ทำให้ความแม่นยำไม่เทียบเท่าตอนเทสกับ test set\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> ความฝันของผมคือการสร้างนวัตกรรมเพื่อเปลี่ยนโลกของเราไปสู่โลกใบใหม่ ในตอนเด็กพ่อของผมมักจะพาผมไปดูหุ่นยนต์ที่ทำงานของพ่อเสมอ นั่นเป็นจุดเริ่มต้นที่ทำให้ผมอยากสร้างของที่สุดยอดเหมือนที่พ่อของผมทำ นั่นทำให้ผมเริ่มศึกษาเกี่ยวกับเทคโนโลยีต่างๆ ดังนั้นเวทีนี้จึงเป็นโอกาสสำคัญ ที่จะทำให้ผมมีประสบการณ์และเรียนรู้ เพื่อที่สักวันหนึ่งผมจะได้สร้างนวัตกรรมที่ไม่ว่าใครๆก็พูดถึง<br>เพื่อให้ความฝันไม่ใช่แค่ความฝัน ในช่วงมัธยมต้นผมจึงได้ฝึกทำหุ่นยนต์ที่เปรียบเสมือนแขนขา และตอนมัธยมปลายได้ฝึกวิธีการคิดในการแก้ปัญหา ตลอดจนเข้าร่วมแข่งคอมพิวเตอร์โอลิมปิกระดับชาติ มาในตอนนี้จึงอยากต่อยอดการพัฒนา ai ที่เปรียบเหมือนสมองของหุ่นยนต์บ้าง<br>การเข้าค่ายครั้งนี้ จะทำให้ผมได้ก้าวเข้าสู่วงการ ai และได้พัฒนาทักษะในการทำงานจริง ตลอดจนได้แลกเปลี่ยนความคิดเห็นและประสบการณ์กับเพื่อนร่วมอบรมและบริษัทชั้นนำด้าน ai ของไทย และยังทำให้ความฝันของผมใกล้จะเป็นจริงขึ้นอีกก้าว\n    ","date":"31-7-24","title":"Parkinson's Disease Early Detection","builder":"สิรวิชญ์ กีรติพรานนท์(ศีล)","builder_info":"เตรียมอุดมศึกษา / กรุงเทพมหานคร","thumbnail":"/images/2024/23/01.png","links":{"github":"https://github.com/seensiravit/Parkinson-Early-Detection","facebook":"","blog":"https://medium.com/@s.keeratipranon/parkinsons-disease-early-detection-e921b764c577"}}},"__N_SSG":true}