{"pageProps":{"postData":{"id":"32-pituphum-shaijarernwana","content":"\n![image](/images/2024/32/01.png)\n\n- โหลด public dataset ใน kaggle ที่ชื่อว่า Eyepacs โดยมี reference เป็น California Healthcare Foundation\n- clean data จาก 88gb -> 8gb\n- มีทั้งหมด 5  class 35,126 pictures\n- ใช้ resnet50 ในการเทรนเนื่องจากมีความสมดุลระหว่างความใหญ่ของโมเดลและ performance\n- Pre-processing ที่ทำ 3 แบบคือ Resize, Resize+normalize และ GaussianBlur\n- ผมลัพธ์ที่ดีที่สุดคือ 5 classes accuracy = 0.75, 2 classes acc = 0.78\n- points for improvement: ลองโมเดลอื่นๆ ลอง pre-process ใหม่\n- ยังมี gap ให้พัฒนาอีกมาก ผลงานอยู่ระดับ minimal viable product(MVP)\n- ใช้เวลาในการเทรนตั้งแต่ ~15sec/its ไปจนถึง 3its/sec\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> 1.&nbsp;&nbsp;พัฒนาความสามารถ: อยากเรียนรู้จากอาจารย์และพี่เลี้ยงของ vistech ที่มีประสบการณ์และความสามารถด้านเทคโนโลยี ช่วยให้ผมพัฒนาทักษะและความรู้ที่มียากในการศึกษาเอง สำคัญคือเตรียมความพร้อมตนแองในการศึกษาระดับอุดมศึกษาด้านนวัตกรรม ซึ่งจะเกิดขึ้นในไม่กี่เดือนข้างหน้านี้ ผมตั้งใจสร้างงานที่ซับซ้อนขึ้น สู่อาชีพทางนวัตกรรมเทคโนโลยีในอนาคต2.&nbsp;&nbsp;พัฒนาบุคลิกภาพ: อยากมีโอกาสทำงานร่วมกับคนที่หลากหลาย ฝึกวินัย ทำงานอย่างเป็นระบบมีขั้นตอน เรียนรู้การทำงานของคนอื่น3.&nbsp;&nbsp;พัฒนาผลงาน: อยากผลักดันความคิดการตรวจคัดกรองโรคเบาหวานขึ้นตา ให้ไปถึงชาวบ้านที่อยู่ห่างไกลรพ.ใหญ่ โดยใช้เทคโนโลยี ai image technology การเข้าร่วมโอการน่าจะทำให้สำเร็จมากยิ่งขึ้น 4.&nbsp;&nbsp;&nbsp;เปลี่ยนความเชื่อ: อยากสร้างแรงบันดาลใจให้แก่น้องโรงเรียนหลายคน ที่สนใจโครงการนี้แต่ไม่กล้าสมัคร ถ้าผมมีโอกาสได้เข้าร่วมจนจบโครงการ จะสามารถแบ่งปันประสบการณ์และการเรียนรู้ของผมให้แก่พวกเขา ซึ่งอาจทำให้หลายคน กล้าออกจาก comfort zone ช่วงซัมเมอร์ในแต่ละปี แทนทำกิจกรรมง่ายๆดูหนังฟังเพลงไปวันๆ เปลี่ยนมาพัฒนาตนเองจากการเข้าร่วมโครงการนี้ในปีหน้า และเป็นลูกโซ่พลังบวกถึงรุ่นน้องถัดต่อๆไปมีซัมเมอร์ที่มีความหมาย: อยากใช้เวลาช่วงรอเปิดเทอมเข้ามหาวิทยาลัยที่นานกว่าครึ่งปีให้มีคุณค่า ผมได้ที่เรียนตั้งแต่ต้นธันวาคมปีที่แล้ว จึงอยากหากิจกรรมที่ตนเองชอบ\n    ","date":"31-7-24","title":"DRCare","builder":"ปิตุภูมิ ชัยเจริญวรรณ(นะโม)","builder_info":"มงฟอร์ตวิทยาลัย / เชียงใหม่","thumbnail":"/images/2024/32/01.png","links":{"github":"https://github.com/NamoShai/DRcare","facebook":"","blog":"https://medium.com/@pituphum.shai/drcare-development-of-a-machine-learning-model-for-smartphone-based-diabetic-retinopathy-screening-a2b562af5de3"}}},"__N_SSG":true}