{"pageProps":{"postData":{"id":"019-ทำนายผลบอลยังไงให้แม่นซะยิ่งกว่าหมึกพอล","content":"\n![Muang](/LICENSEimages/2021/019/02.jpg)\n\n- คุณเคยหรือไม่ เถียงกับเพื่อนเรื่องบอลว่าทีมไหนจะชนะ? เถียงกับคนใน Internet ว่าถ้าทีม Manchester United เจอ Liverpool ใครจะชนะ? หากคุณเคยพบกับปัญหาเหล่านี้ เรามีทางออกให้กับคุณกับโปรเจ็ค “ทำนายผลบอลยังไงให้แม่นซะยิ่งกว่าหมึกพอล” เมื่อเรานำเอาโมเดล Machine Learning มาทำนายผลบอลจากค่าสถิติแมทช์ที่ผ่านมา\n- เริ่มจากเราเอาค่าสถิติจากแมทช์ที่ผ่านมาจาก Premier League ปี 2018-2020 และค่า stat ของผู้เล่นจาก FIFA 19 มาทำ feature engineer โดยอ้างอิงกับตำแหน่งของผู้เล่นเช่น ทำการหาค่าเฉลี่ยค่า stat ของผู้เล่นในตำแหน่งที่ใกล้เคียงกัน \n- จากนั้นนำสถิติการเล่นทั้งหมดของแต่ละทีม (แมทช์เล่นในบ้าน) ในแต่ละปีมาสร้างฟีเจอร์เพื่อช่วยให้โมเดลทำนายผลแม่นขึ้น\n- แต่! ฟีเจอร์ที่มีตอนนี้มีถึง 259 ฟีเจอร์!! เราเลยทำการหาค่า Correlation ระหว่างฟีเจอร์และใช้โมเดล Sequential Feature Selector เพื่อหาฟีเจอร์สุดท้าย ซึ่งเราจะลดได้จนเหลือ 50 ฟีเจอร์!!\n- และสุดท้ายเราสร้างโมเดล kNN ขึ้นมาเพื่อทำนายว่า ถ้าแต่ละทีมเจอกัน ทีมไหนจะชนะ (เจ้าบ้านหรือทีมเยือน) ซึ่งค่าความแม่นยำของเรานั้นดีกว่าโมเดลที่คนทำแข่งกันบน Kaggle!! แต่ยังไม่แนะนำให้เอาไปใช้จริงนะ ฮ่า ๆ\n\n![Data](/images/2021/019/03.png)\n\n\n![Preprocessing](/images/2021/019/04.png)\n\n\n![Modeling](/images/2021/019/05.png)\n\n### แรงจูงใจในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 9 สัปดาห์ที่แล้ว)\n> \"ผมมีความฝันที่อยากจะทำงานเป็น data scientist หรืออาจเป็น machine learning engineer ในอนาคตครับ ผมรู้ตัวช้าไปว่ามีความชื่นชอบทางด้านนี้ทำให้ผมเสียโอกาสในการเข้าค่ายโอลิมปิกวิชาการคอมพิวเตอร์ไป ถึงแม้การศึกษาเรียนรู้ด้วยตัวเองจากคอร์สออนไลน์ต่างๆจะทำให้ผมพอเขียนโปรแกรมได้บ้าง แต่การที่ปราศจากผู้รู้คอยชี้แนะแนวทางให้มันทำให้ผมกลับรู้สึกว่าผมเองยังไม่สามารถนำโค้ดที่เขียนนี้ไปใช้จริงได้เท่าไหร่นัก ซึ่งผมได้เห็นว่าโครงการ AI Builders นี้เป็นโอกาสที่ดีที่ผมจะได้พัฒนาความรู้ของตัวเองเพิ่มเติมในด้าน AI พร้อมทั้งยังได้ฝึกเขียนโค้ดสำหรับใช้งานจริงในการทำโครงงานด้วยครับ\"","date":"2021-07-22","title":"ทำนายผลบอลยังไงให้แม่นซะยิ่งกว่าหมึกพอล","builder":"Pittinan Harnsinghkun (Muang)","builder_info":"มัธยมศึกษาปีที่ 6 / เพชรบุรี","thumbnail":"/images/2021/019/01.png","links":{"github":"https://github.com/mharnsingh/EPL-Outcome-Predition","facebook":"https://www.facebook.com/aibuildersx/posts/177745394393908","blog":"https://mharnsingh.medium.com/ทำนายผลบอลด้วย-stats-ผู้เล่นจาก-fifa19-และค่าสถิติแมทช์ที่ผ่านมา-3952e8b7057e"}}},"__N_SSG":true}