{"pageProps":{"postData":{"id":"82-manga-recommendation","content":"\n![image](/images/2023/82/01.jpg)\n\n- ระบบแนะนำการ์ตูนเล่มญี่ปุ่น (manga) ด้วยคำสั่งภาษาธรรมชาติ (อังกฤษ, ไทย และอื่นๆ) ที่แนะนำได้ดีกว่า ChatGPT เมื่อประเมินโดยมนุษย์\n- ภาพที่มองไว้คือตอบโจทย์นักอ่านเรื่องมาก เช่น อยากได้มังงะที่ตัวเอกมีพลัง มีเรื่องวิญญาณ แต่ไม่ใช่ผี มีเรื่องคำสาป เรื่องคุณไสย (ถ้าจะเรื่องมากขนาดนี้!!) ก็อยากให้ user มาใส่ความต้องการเข้าไป แล้วก็ output เป็นมังงะซัก 5 เรื่องที่ใกล้เคียงกับความต้องการมากที่สุด\n- เริ่มต้นเก็บข้อมูลจากการ scrape MyAnimeList.net และ anime-planet แต่ประสบปัญหา จึงลองใช้ชุดข้อมูล victorsoeiro/manga-manhwa-and-manhua-datasetจาก Kaggle แทน\n- สร้างชุดข้อมูล (คำสั่งค้นหา, คำอธิบายการ์ตูน) โดยการใช้ LLaMA2 สร้างคำสั่งขึ้นมาด้วย Prompt “[Given the description] Give me 5 natural language query which don't be too specific and not mention about manga name and character that will return a manga with the following description”\n- คำสั่งค้นหาที่ได้มา ยกตัวอย่างถ้าเป็น My Hero Academia โมเดล LLaMA2 จะแนะนำ “What is the name of a manga about a middle school student who wants to be a hero but doesn’t have any powers?”\n- ใช้ all-MiniLM-L6-v2 และ paraphrase-multilingual-mpnet-base-v2 ผ่าน SentenceTransformer เพื่อคำนวณความใกล้ของคำสั่งค้นหากับคำอธิบายการ์ตูน; ข้อดีของการเริ่มด้วย multilingual model คือสามารถค้นหาข้ามภาษาได้ แม้ชุดข้อมูลของเราจะเป็นภาษาอังกฤษล้วน เช่น “ขอการ์ตูนเด็กแว่นนักสืบ” ก็จะได้ Detective Conan\n- หลังการ finetune ทุกโมเดลมี top-k accuracy เพิ่มขึ้นประมาณ10% (top-1 75%, top-3 80%, top-5 85%); top-k accuracy คือโมเดลแนะนำถูกภายในเรื่องที่มั่นใจที่สุดกี่เรื่อง\n- ทำแบบทดสอบกับผู้ใช้จริงแล้วพบว่าแนะนำได้ตรงใจกว่า ChatGPT; เหตุผลคือ ChatGPT ไม่ได้ถูก finetune กับชุดข้อมูลเฉพาะทาง ทำให้จะแนะนำแต่การ์ตูนตลาด เช่น วันพีซ นารุโตะ\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> ที่ผ่านมาตอนเริ่มเขียนโค้ดใหม่ก็ได้ไปเรียนที่สอนโค้ดที่หนึ่งพี่เจ้าของก็จะชอบให้งานเจน และบอกกับเจนว่าเจนเหมือนพี่ บางทีให้โจทย์โจทย์นึงมา พอลองตอบไปก็พบว่า แกจะชอบบอกว่า คำตอบของเจนเข้าใกล้ความถูกต้องแล้ว แต่เจนยังไม่ break through ไปถึงคำตอบซักทีเจนไม่ยอมวาปไปถึงคำตอบ หลังจากนั้นก็มีคำถามมากมายในหัวเจนว่า เราวาปได้หรอ ถ้าเรา break through แล้วจะได้อะไร จะ level up หรอ เขาจะชอบให้เจน break limit ทำอะไรให้เกิน limit ตัวเอง ตอนนั้นเจนคงว่างเลยทำตามไป ตอนนั้นมีฝืนร่างกายบ้าง ตอนนั้นเชื่อคนง่าย ไม่มั่นใจในตัวเอง แต่ผ่านไปซักพักเจนมั่นใจในตัวเอง เขาบอกว่าเป็นการมั่นใจที่ผิดๆ แถมพี่ในที่นั้นที่เคยสอนเจน ก็ชอบดูถูกเจน เลยคิดว่าถ้าตัวเองเก่งขึ้น พัฒนาตัวเองได้มากขึ้น โดยไม่ฝืนร่างกาย ทำอะไรที่เป็นรูปธรรมที่มีประโยชน์ และพวกเขาได้ใช้และรู้ว่ามาจากเจน มันคงเป็นความรู้สึกดีมากๆ ที่ทำให้พวกเขาได้รู้ว่าเจนไม่ใช่คนชักจูงง่าย ไม่มั่นใจในตัวเอง ไม่ใช่เหมือนที่เขาดูถูกไว้ ทำประโยชน์ให้หลายๆคนได้ อีกอย่างคือเวลาเราทำอะไรที่เราชอบ แล้วมันมีประโยชน์ต่อคนอื่น ที่บ้านบางครั้งก็ชอบบ่นว่าเจนได้เริ่มเขียนโค้ดตอนช่วงโควิด ตอนนั้นเขียนเพราะไม่มีอะไรทำ ทำไปทำมา ก็ได้มาสอนที่ hamster hub เรื่อง basic python, oop จากนั้นก็ได้ลองคิดคอร์ส math with python ep.2, 4(logic, probablity) ตอนนั้นสนุกกับการเขียน python มากๆ หลังจากนั้นก็ต้องไปโรงเรียนซึ่งต้องอยู่หอ ทำให้ตัดสินใจพักงานสอน หลังจากนั้นไม่นานก็ทำสัมมนาที่โรงเรียน กับโครงงานเรื่อง stock portfolio optimization ทำให้เจนกลับมาเขียนโค้ดจริงจังอีกครั้ง ก่อนหน้านี้ก็มีเขียนบ้าง แต่ไม่ได้จริงจังมาก เริ่มมาศึกษา ai และได้เข้าร่วม cai hackathon : ได้ที่ 1 มา จากการทำ ai เรื่อง ai for mental health https://www.cpall.co.th/news/csr/creative-ai-club-hackathon เป็นจุดเปลี่ยนที่สำคัญที่ทำให้รู้สึกว่า เราน่าจะคิดอะไรที่เป็นประโยชน์ต่อคนอื่นได้ เลยลองสมัคร caic ซึ่งตอนนั้นได้รับโจทย์ ai เพื่อการตรวจสอบมาตราฐานของสมอบก ตอนนั้นเครียดมากเพราะมีเข้าค่าย สอวน.คอมพิวเตอร์ซ้อน แถมเพื่อนร่วมทีมเทงานไม่ค่อยช่วย เลยต้องเอามาทำ แต่ทุกอย่างก็ผ่านไปได้ ติดสอวน.รอบ 2 แต่ไม่ได้รางวัลอะไรจาก caic แต่ตรงนั้นทำให้รู้สึกว่าเราน่าจะลองทำ ai จริงจัง เพื่อช่วยคนอื่นซักทีนะ เพราะตอนได้สอนแล้วเห็นคนอื่นเข้าใจ\n","date":"31-7-24","title":"Manga Recommendation","builder":"Jenta Wonglertsakul","builder_info":"มัธยมศึกษาปีที่ 5.0 -- กรุงเทพมหานคร","thumbnail":"/images/2023/82/01.jpg","links":{"github":"https://github.com/jjentaa/manga-recommendation","facebook":"https://www.facebook.com/aibuildersx/posts/pfbid0FHypCZy4s5ACv9WqSdxx6v9HtbVjZ2yhjuhAfcVCzf2hXCd5sc7285o2tx8iZ5Sol","blog":"https://medium.com/@madness_/manga-recommendation-️-a8147d933c51"}}},"__N_SSG":true}