{"pageProps":{"postData":{"id":"89-pm2.5-time-series-forecasting","content":"\n![image](/images/2023/89/01.jpg)\n\n- โมเดลทำนายปริมาณฝุ่น PM2.5 รายวันด้วย RNN, LSTM และ NHITS\n- ใช้ชุดข้อมูลปริมาณฝุ่นจากปี 2011-2021 สำหรับเทรนโมเดลและตรวจสอบโมเดลด้วยปี 2022\n- เปรียบเทียบโมเดลที่ใช้มีความซับซ้อนมาขึ้นเรื่อยๆ เริ่มจาก RNN, LSTM ที่เพิ่ม long short-term memory, และ NHITS ที่พัฒนาจาก NBEATS โมเดลใหม่นี้เสนอโดย Challu และ Olivares และคณะ ปรับปรุงการจัดการอินพุตและการสร้างเอาต์พุต ทำให้มีความแม่นยำดีขึ้นและต้นทุนการคำนวณลดลง\n- สามารถทดลองโมเดลได้หลากหลายด้วย library แสนสะดวก neuralforecast\n- วัดผลด้วย MAE, MAPE, และ RMSE พบว่า RNN ได้ metric ที่ดีที่สุดแต่ LSTM กับ NHITS สามารถทำนาย peak ของ PM2.5 ได้ใกล้เคียงความเป็นจริง ในขณะที่ RNN ดูจะประเมิน peak ต่ำกว่าความเป็นจริง\n- ความท้าทายของงานคือปริมาณฝุ่น PM2.5 ขึ้นอยู่กับปัจจัยภายนอก เช่น นโยบายรัฐ, สภาพอากาศ, การเผาในที่โล่งทำให้ค่า PM2.5 ในอดีตอย่างเดียวอาจไม่สามารถทำนายได้แม่นยำ\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> ส่วนตัวนั้นได้ทราบถึงการมีอยู่ของโครงการมาตั้งแต่ season 1 โดยถือว่าโครงการนี้มีกลุ่มเป้าหมายที่ชัดเจนเป็นอย่างมากก็คือต้องเป็นผู้ที่อยู่ในชั้นมัธยมศึกษา นั่นแสดงว่าผมก็ยังสามารถที่จะเข้าร่วมได้ และจากนั้นก็ได้ทำการสมัครเรื่อยมา เนื่องจากผมนั้นต้องการที่จะพัฒนาความรู้ ทักษะด้านปัญญาประดิษฐ์ และ data science เพื่อที่จะให้รู้ว่าสิ่งนี้นั้นเหมาะกับตัวผมหรือไม่ ถึงแม้ว่าปีที่ผ่านๆ มา ผมจะไม่ได้รับการคัดเลือกแต่ผมก็ยังทำการศึกษาเรียนรู้ด้วยตัวเองมาเรื่อยๆ และได้เห็นผลงานของแต่ละรุ่นที่พัฒนาออกมา รวมไปถึงผลงานของเพื่อนของผมที่อยู่ในโครงการนี้นั้นถือว่าสุดยอดมากๆ ทำให้ผมมีความมุ่งมั่นที่จะสามารถทำได้อย่างนั้นบ้าง โดยผมมองว่าการที่ผมเรียนรู้ด้วยตัวเองนั้น ยังขาดสิ่งสำคัญไปบางอย่าง นั่นก็คือการที่มีแรงจูงใจ แรงบันดาลใจ ในการทำสิ่งใดสิ่งนึงได้ตลอดเวลา แล้วจะเป็นอย่างไร ถ้ามีเพื่อนที่รุ่นราวคราวเดียวกัน มาเรียนรู้ด้วยกัน ซักถามกันได้ แลกเปลี่ยนความรู้กัน อีกทั้งยังมี ta คอยให้คำปรึกษาอีกมันจะเป็นอย่างไร ในส่วนนี้นั้นทำให้ผมอยากที่จะเข้าร่วมในโครงการนี้เป็นอย่างมาก และนี้ก็เป็นโอกาสสุดท้ายแล้วที่ผมจะได้สมัครโครงการนี้ ผมจะให้เต็มที่แน่นอนครับ\n    ","date":"31-7-24","title":"PM2.5 Time Series Forecasting","builder":"Natthawee Naewkumpol","builder_info":"มัธยมศึกษาปีที่ 6.0 -- บุรีรัมย์","thumbnail":"/images/2023/89/01.jpg","links":{"github":"https://github.com/Parallaxxx25/AIB3_Proj.git","facebook":"https://www.facebook.com/aibuildersx/posts/pfbid0uuzHUFhLpCF82WMw9ErkLWJLWkfNKhJGoEAH7HuqQPx6WRxspk6zh2fYiHjHPhXGl","blog":"https://medium.com/@nattawee2548/pm2-5-time-series-forecasting-5b9d3a75b2fa"}}},"__N_SSG":true}