{"pageProps":{"postData":{"id":"002-LiDAR-3D-Point-Cloud-Object-Detection-for-Autonomous-Vehicle","content":"\n![Patrick](/images/2021/002/02.png)\n\n- นำ Point Cloud ที่ได้จาก LiDAR มาทำนายเพื่อตรวจหา รถ คน และคนปั่นจักรยานบน KITTI Dataset เพื่อประยุกต์ใช้กับระบบยานยนต์ไร้คนขับ\n- Point Cloud คือจุดที่เกิดจากการสะท้อนของเลเซอร์จากเซนเซอร์ LiDAR ที่ใช้เป็นเซนเซอร์ของรถหรือยานพาหนะส่วนใหญ่\n- ใช้ spatially sparse CNN ต่อกับ object detection head เพื่อตรวจจับวัตถุได้หลายชิ้น คล้ายกับโมเดล PointPillars ([https://arxiv.org/abs/1812.05784](https://arxiv.org/abs/1812.05784))\n- เวลานับ 100 ชั่วโมงกับการเขียนแต่งเติมโมเดล รวมไปถึงการเปลี่ยน architecture และปรับแต่ง loss function ขึ้นมาเอง\n- ประสิทธิภาพของโมเดลดีกว่า PointPillars อดีตโมเดลที่ดีที่สุดโมเดลหนึ่ง ใน validation set เดียวกัน\n- เป้าหมายคือการพัฒนาให้ดีพอจะตีพิมพ์ใน conference ระดับโลกได้ในชื่อ PatrickNet\n- รางวัลขวัญใจกรรมการในแง่ความเป็นเลิศทางเทคนิค ได้ใจกรรมการไปอย่างท่วมท้นจากการค้นคว้างานวิจัยหลากหลายงานจากงานวิชาการทั้งเก่าและใหม่ด้วยตนเอง\n- ดูผลการทำนายได้ทาง webapp ที่ถูก deploy บน Heroku\n\n### แรงจูงใจในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 9 สัปดาห์ที่แล้ว)\n\n> \"อยากนำความรู้ความสามารถที่ได้รับจากการเข้าร่วมโครงการ มาพัฒนาโปรเจคของตนเองเพื่อสร้างปัญญาประดิษฐ์ที่มีประโยชน์ต่อสังคมและประเทศชาติ\"\n>\n> \"[https://github.com/PatrickChoDev/SignerCSLR](https://github.com/PatrickChoDev/SignerCSLR) เป็นผลงานที่ผมภาคภูมิใจในการนำเสนอเกี่ยวกับปัญญาประดิษฐ์เพราะเป็นหนึ่งในผลงานของผมที่ได้สร้างเครื่องมือแปลภาษามือด้วยเทคนิค Transformer และ CNN+BiRNN เพื่อใช้สื่อสารกับผู้พิการ แต่ประสิทธิภาพยังไม่ค่อยดีมากเท่าไหร่ จึงอยากที่จะพัฒนาต่อแต่ความรู้ที่ได้จากการคว้าไม่พอครับ แรงบันดาลใจในการพัฒนาปัญญาประดิษฐ์ส่วนใหญ่จะมาจาก JARVIS ที่เป็นผู้ช่วยเสทอนของไอรอนแมน ซึ่งถ้านำมาใช้งานได้จริง น่าจะมีประโยชน์หลายๆด้านเลยครับ\"\n>\n>หลังจบการศึกษา:\n>\n>\"ตั้งใจทำเรื่องนี้เพราะคิดว่า Deep learning ควรจะเข้ามาเป็นส่วนหนึ่งในชีวิตประจำวันของเรา เพราะว่าอีกไม่นานโลกก็จะก้าวเข้าสู่ยุค 5.0 ที่จะเน้นเรื่องความสัมพันธ์ระหว่างมนุษย์กับ Machine แตกต่างจากมุมมองยุค 4.0 ว่า AI จะเข้ามาแย่งงานพวกเรากันหมด ซึ่งเป็นความคิดที่ผิดมหันต์หลังจากได้มาทำความรู้จักกับ AI อย่างถ่องแท้จากพี่ๆ mentors ใน AI Builders และผมมองว่าประเทศไทยก็ควรจะมีเทคโนโลยีเป็นของตัวเอง เพื่อให้คนภายในประเทศได้ภาคูมิใจว่าได้ใช้ของๆคนไทยกันเอง เลยเห็นว่า Autonomous Vehicle เป็นกระแสที่มาแรงและเข้ากับ Idea 5.0 เลยตั้งใจทำโปรเจคนี้ขึ้นมา ถึงแม้จะเป็นส่วนเล็กๆของ Autonomous Vehicle แต่ก็จะน่าจะช่วยทำให้ระบบ AV ทำงานได้ดีขึ้นด้วยการ Improve และ optimize ให้ใช้ได้ในชีวิตจริงๆ ไม่จำเป็นต้องถูกเป๊ะแบบบางงานวิจัยที่เน้นประสิทธิภาพแต่ไม่ได้เน้นเรื่องของเวลารันไทม์ครับ\"\n>\n> \"สำหรับ PatrickNet จะเป็นโมเดลที่ถูกพัฒนาต่อจากงานที่ผมทำในค่าย AI Builders และจะออกมาในรูปแบบของงานวิจัยเพือให้ผู้คนที่สนใจได้ศึกษาต่อ โดยคร่าวๆผมจะใช้เทคนิคที่ดีขึ้น ไวขึ้น เพื่อให้คงประสิทธภาพเดิมได้ แต่ใช้เวลาในการประมวลผลที่น้อยที่สุด และจะมีการนำ Image เข้ามาใช้ด้วยเพื่อเพิ่มประสิทธิภาพใน Real world application จากเหตุการณ์ที่ไม่คาดคิดที่ LiDAR มองไม่เห็นครับ\"\n>\n>\"ฝากถึงน้องๆ AI Builders รุ่นถัดไปว่า ถึงแม้ว่าเราจะเป็นคนๆหนึ่งที่อาศัยอยู่บนโลกใบนี้ มันน่าจะดีถ้าเราได้ทำอะไรไว้ให้กับคนรุ่นต่อๆไป ดีกว่าที่เราจะปล่อยให้เวลาแต่ละวันของเราผ่านไปอย่างไม่มีจุดหมาย ถึงแม้จะยากแค่ไหนแต่เพียงแค่ใจเรามีคำว่า 'สู้' เราก็ไปต่อได้ครับ AI Builders เป็นค่ายดีๆที่ควรเข้าเพราะพี่ๆ Mentors เก่งและใจดีทุกท่านเลยครับ\"\n","date":"2021-07-05","title":"LiDAR 3D Point Cloud Object Detection for Autonomous Vehicle","builder":"Thanapat Chotipun (Patrick)","builder_info":"มัธยมศึกษาปีที่ 5 / กรุงเทพมหานคร","thumbnail":"/images/2021/002/01.png","links":{"github":"https://github.com/PatrickChoDev/LiDAR-ObjDetect","facebook":"https://www.facebook.com/aibuildersx/posts/166119965556451","blog":"https://patrickchodev.medium.com/patrickchodev-3d-object-detection-using-point-clouds-4106f26dd0d2"}}},"__N_SSG":true}