{"pageProps":{"postData":{"id":"95-teeor","content":"\n![image](/images/2023/95/01.jpg)\n\n- ระบบตรวจสอบความเสี่ยงทุจริตในเอกสารการจัดซื้อจัดจ้าง (TOR) ของราชการในระบบe-bidding ด้วย OCR และ NER\n- องค์กรต่อต้านคอรัปชั่น พบว่าในปี พ.ศ.2558–2564 จากข้อมูลทั้งหมด 22,182,987 โครงการพบโครงการที่ใช้ e-bidding และมีความเสี่ยงที่จะผิดปกติทั้งสิ้น 80,866 โครงการ โดยสาเหตุหลักๆมาจากความผิดพลาดส่วนบุคคลและความเป็นกลางของผู้ตรวจ\n- สร้างชุดข้อมูลจากการจัดซื้อจัดจ้างครุภัณฑ์มา 4 ชนิด คือ ตู้เหล็ก เครื่องทำลายเอกสาร เครื่องถ่ายเอกสารระบบดิจิตอล และเครื่องปรับอากาศเเบบเเยกส่วน รวม 330 เอกสาร\n- นิยามเอกสารจัดซื้อจัดจ้างที่มีความเสี่ยงที่จะผิดปกติว่ามีรายละเอียดในหัวข้อคุณลักษณะของครุภัณฑ์ที่เขียนนอกขอบเขตของมาตรฐานครุภัณฑ์ที่มีกำหนดไว้ โดยที่นอกขอบเขตในที่นี้เป็นลักษณะที่ส่อไปในทางล็อกสเป็ค เช่น การกำหนดลักษณะเฉพาะ รุ่นหรือยี่ห้อ รวมถึงการเขียนเอื้อให้กับผู้ผลิตหรือบริษัทใดบริษัทหนึ่ง เป็นต้น\n- ใช้ Tesseract OCR ในการเปลี่ยนข้อมูล pdf เป็น plain text\n- เปรียบเทียบการ finetune wangchanberta และ roberta-base-language-detection ในการจำแนกเอกสารที่มีความเสี่ยงได้ความแม่นยำ 93.66% และ 92.39% ตามลำดับ; วัดผลตามจำนวน NER tag ที่เสี่ยงและไม่เสี่ยงเกิดการทุจริต\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> ผมเป็นคนนึงที่ชอบเรียนรู้และรักในการเขียนโปรแกรมมากครับ ผมอยากได้ทำโปรเจ็คที่ท้าทายและอยากเรียนรู้เรื่องปัญญาประดิษฐ์ครับ ประกอบกับอยากได้คำแนะนำต่างจากพี่ๆ mentor ครับ อยากแลกเปลี่ยนความรู้ ความคิดเห็น คำแนะนำ กับเพื่อนๆ พี่ๆ ใน ai builder ครับ ผมตั้งใจเป็นอย่างยิ่งครับที่จะพัฒนา ต่อยอดองค์ความรู้ที่ได้จากทาง ai builder มาคิดค้นเทคโนโลยีในการช่วยพัฒนาประเทศครับเนื่องจากผมมีความสนใจในการเขียนโปรแกรมมาตั้งแต่ตอน ม.3 ครับ ตอนนั้นเริ่มชอบมาจากการเขียนเว็ปสนุกๆ พอตอน ม.4 ก็หันมาจริงจังกับ python ได้ผ่านการรับรองการทำโจทย์ python จาก devlab และได้แข่งขัน first tech challenge thailand 2022-2023 ในตำแหน่ง โปรแกรมเมอร์ของทีมโรงเรียนสระบุรีวิทยาคม (ภาษาjava) จนไปแข่งศิลปะหัตถกรรม ครั้งที่ 70 รายการเขียนโปรแกรมด้วยภาษาคอมพิวเตอร์ได้เหรียญทองชนะเลิศอันดับ1ในระดับ สพม และได้เหรียญทองในระดับชาติ (ภาษาpython) ผมจึงอยากร่วมเป็นส่วนในการขับเคลื่อนในสิ่งที่ผมรักครับ\n    ","date":"31-7-24","title":"TEEOR","builder":"Pataradanai Akkratch","builder_info":"มัธยมศึกษาปีที่ 5.0 -- สระบุรี","thumbnail":"/images/2023/95/01.jpg","links":{"github":"https://github.com/fifaak/AIB3-TEEOR","facebook":"https://www.facebook.com/aibuildersx/posts/pfbid02zyDWqCG446qr5Pu6i677hgHHjDZVsVp9HHVpVE2bmU54a4fK4iTa1ZN92EZ4yKyLl","blog":"https://medium.com/@pataradany/teeor-the-first-procurement-books-checker-tool-of-thailand-8c794987fbba"}}},"__N_SSG":true}