{"pageProps":{"postData":{"id":"96-catsification","content":"\n![image](/images/2023/96/01.jpg)\n\n- The Cat Classification AI Model\n- โมเดลจำแนกแมว 40 รูปแบบจากรูปภาพคนอวดแมวตามกระทู้ในอินเตอร์เน็ต\n- แรงบันดาลใจจากการอยากรู้ว่าถ้าเราจะอวดแมวเราควรจะโพสที่ subreddit ไหน ในเมื่อ Reddit มี subreddit เกี่ยวกับแมวกว่า 800 อัน ส่วนใหญ่แยกตามสายพันธุ์/ลาย\n- เก็บข้อมูลจาก subreddit ด้วย library gallery-dl; ทำความสะอาดด้วยการนำรูปที่ไม่ใช่แมวออกด้วย zero-shot classification จากโมเดล pretrained, เลือกเฉพาะรูปที่ได้รับ upvote เยอะ (ทำให้ความแม่นยำเพิ่มขึ้นถึง 10%!), ลดจำนวนรูปแบบแมวโดยรวมแมวที่รูปแบบคล้ายกันเข้าด้วยกัน, และไม่จำแนกรูปแบบที่จำแนกด้วยรูปภาพเพียงอย่างเดียวไม่ได้ เช่น sleepy cats, angry cats, fat cats, small cats\n- ใช้สถาปัตยกรรม resnet50 เทรนบนรูปประมาณ900 รูปต่อรูปแบบ และทดสอบประสิทธิภาพบนชุดข้อมูลประมาณ 100 รูปต่อรูปแบบ; ได้ความแม่นยำ 86% (top-3) และ 60% (top-1) เทียบกับ zero-shot classification ที่ 59% และ 39%\n- วัดผลด้วย top-3 evaluation เนื่องจากในการใช้งานจริง หากโมเดลแนะนำ 3 subreddits ที่มีโอกาสเกี่ยวกับแมวของเราก็น่าจะดีพอแล้ว\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> ผมมีความสนใจในเทคโนโลยี และ ai เพราะ ai ในปัจจุบันได้ถูกนำไปประยุกต์ใช้ในสิ่งต่างๆ ได้หลายอย่างมากตั้งแต่การทำ speech-to-text,การสร้างรูปภาพจากคำอธิบาย ไปจนถึง การพูดคุยตอบโต้กับคนเราได้อย่างเป็นธรรมชาติครับ ในอนาคต ผมคิดว่า ai มีศักยภาพที่จะสามารถช่วยพัฒนาสิ่งต่างๆได้หลากหลายรูปแบบอย่างที่เราไม่เคยคิดถึงมาก่อน ช่วยแก้ปัญหาและทำให้คนมีความสะดวกสบาย หรือมีประสิทธิภาพมากขึ้น ผมจึงสนใจใน กระบวนการการสร้าง ai และหวังว่าจะสามารถสร้าง ai อย่างง่ายขึ้นมาสักตัวครับผมมีความสนใจในเทคโนโลยีและ ai และพอมีความรู้เบื้องต้นในการเขียนโค้ด python และ html บ้างเล็กน้อย และแม้ว่าผมจะไม่มีประสบการณ์ในการสร้าง ai สักนิดเลย ผมก็อยากที่จะเข้าร่วมโครงการนี้ เพราะผมเชื่อว่าผมจะได้เรียนรู้วิธีการต่างๆในการสร้าง ai ในโครงการนี้เพื่อนำมาใช้ในการสร้าง ai ที่เกี่ยวกับแมวครับ และผมเชื่อว่าความรู้และประสบการณ์ที่จะได้รับจากโครงการนี้จะเป็นทั้งจุดเริ่มต้นและยังสามารถช่วยต่อยอดในการพัฒนาสิ่งต่างๆต่อไปครับ\n    ","date":"31-7-24","title":"CATsification","builder":"Pawinthawat Chandravat","builder_info":"มัธยมศึกษาปีที่ 3.0 -- กรุงเทพมหานคร","thumbnail":"/images/2023/96/01.jpg","links":{"github":"https://github.com/PawinChan/CATsification","facebook":"https://www.facebook.com/aibuildersx/posts/pfbid0L8kyxPkXs2FK9oHCJd7utjMLeUCtMKwWooU5RHPyZHnPPMWciCrH6HwmE4wpTZKwl","blog":"https://medium.com/@Pawin.C/catsification-the-cat-classification-ai-model-9580f68fcb03"}}},"__N_SSG":true}