{"pageProps":{"postData":{"id":"20-phetdau-dueramae","content":"\n![image](/images/2024/20/01.png)\n\n- โมเดลทำนายโรคทรวงอก 14 ชนิด จากภาพเอกซเรย์ทรวงอกด้วย Mobilenetv2 และ Resnet50\n- โรคทรวงอกส่งผลกระทบต่อผู้คนมากมายและเป็นสาเหตุหลักของการเสียชีวิตทั่วโลก โรคปอดอุดกั้นเรื้อรัง หลอดลมอักเสบเรื้อรัง พังผืดปอด และปอดบวมมีความเสี่ยงสูงต่อการเป็นมะเร็งปอด แม้ในผู้ที่ไม่สูบบุหรี่ก็ตาม การวินิจฉัยที่มีประสิทธิภาพจึงสำคัญในการตรวจหาโรคทรวงอกในระยะเริ่มต้น ประเมินระดับความรุนแรง และตรวจหาภาวะแทรกซ้อน การถ่ายภาพเอกซเรย์ทรวงอก (CXR) เป็นวิธีการที่นิยมใช้ โดยจำเป็นต้องอาศัยบุคลากรทางการแพทย์และผู้เชี่ยวชาญในการจำแนก จึงเป็นเหตุผลที่ดีถ้าเราจะนำ AI เข้าไปช่วยบุคลากรทางการแพทย์ เพื่อเพิ่มประสิทธิภาพทางการรักษาได้มากยิ่งขึ้น\n- ใช้ข้อมูลจาก kaggle dataset nih image 600 และ kaggle dataset nih dataframe โดยข้อมูลโรคทรวงอกประกอบไปด้วยโรค 14 ชนิด ได้แก่ Cardiomegaly, Hernia, Infiltration, Nodule, Emphysema, Effusion, Atelectasis, Pleural Thickening, Pneumothorax, Mass, Fibrosis, Consolidation, Edema, Pneumonia ทั้งหมด 51,759 ภาพ\n- แบ่ง train valid test spilt ที่ 80/10/10 ได้เป็น train set จำนวน 41,407 ภาพ, validation set 5,176 จำนวน  ภาพและtest set จำนวน 5,176 ภาพ\n- ทดลองเทรนจำนวน 10 epochs บนสถาปัตยกรรม Mobilemetv2 และ Resnet50 ได้ค่า f1 score บน test set 0.47, 0.51 ตามลำดับ\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> โดยทั่วไปแล้วหนูมีความสนใจในคอมพิวเตอร์และเทคโนโลยีอยู่แล้ว เมื่อได้รู้จักaiหนูรู้สึกทึ่งกับเทคโนโลยีนี้มาก ๆ เพราะaiเสามารถทำงานโดยการรับข้อมูล วิเคราะห์ข้อมูลและประมวลผลออกมาเป็นผลลัพธ์ในรูปแบบต่าง ๆ ซึ่งสามารถนำไปประยุกต์ใช้ให้ตรงตามจุดประสงค์ที่เราต้องการ เมื่อได้เห็นโครงการai buildersจึงอยากเข้ามาเรียนรู้การทำaiเพราะในปัจจุบันแล้วเนื่องaiเข้ามามีบทบาทสำคัญแแก้ปัญหาต่าง ๆ และยังเป็นการพัฒนาเทคโนโลยีเจ๋ง ๆ ในยุดปัจจุบันอีกด้วย ซึ่งตัวหนูเองอยากได้รับความรู้และประสบการณ์การทำaiและยังมีพี่ผู้เชี่ยวชาญในโครงการนี้ให้คำแนะนำอีกด้วย เพื่อนำสิ่งที่ได้รับมาทั้งหมดนี้มาพัฒนาทำprojectต่าง ๆ ในอนาคตที่นำaiมาเป็นส่วนสำคัญในการแก้ปัญหาต่าง ๆ ที่เกิดขึ้นในชีวิตจริง\n    ","date":"31-7-24","title":"Multi label x-ray image classification","builder":"เพชรดาว ดือราแม(เพชร)","builder_info":"วิทยาศาสตร์จุฬาภรณราชวิทยาลัย / สตูล","thumbnail":"/images/2024/20/01.png","links":{"github":"https://github.com/PDOTXITE/Multi_label_Xray_image_classification","facebook":"","blog":"https://medium.com/@petdau1995/multi-label-x-ray-image-classification-6569e844911e"}}},"__N_SSG":true}