{"pageProps":{"postData":{"id":"25-chananchai-chanmol","content":"\n![image](/images/2024/25/01.png)\n\n- โมเดลจำแนกระดับโรคข้อเข่าเสื่อม 5 ระดับ ตามหลัก KL system\n- วัดผลเทียบกับนักศึกษาแพทย์ ด้วย test set 20 รูป มีค่าเฉลี่ยที่ 25.85% และทำได้ดีที่สุด 40%\n- ใช้ชุดข้อมูลจาก Kaggle แล้วมาตรวจสอบรูปภาพด้วยตนเอง \n- ทดสอบด้วย raw data กับสถาปัตยกรรม ResNet18, ResNet34, ResNet50, VGG-16 และ Vision Transformer พบว่า ResNet34 ได้ผลดีที่สุดบน validation set\n- หลักจากนั้นทดลอง preprocess และ augmentation หลายรูปแบบจนได้ accuracy 88% บน validation set และเทียบกับนักศึกษาแพทย์ด้วยรูปจาก test set โมเดลทำได้ 55% เทียบกับนักศึกษาแพทย์ที่เก่งที่สุดที่ 40%\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> ผมเป็นหนึ่งในคนที่ชื่นชอบการเขียนโปรแกรมมาตั่งแต่ช่วงม.ต้นจากการได้เรียนภาษา python ครับ และตอนนี้ผมสนใจในด้าน data science และ ai เป็นอย่างมากจากการที่ได้ตามอ่านด้านนี้ทาง medium ครับ ส่วนตัวผมนั้นเคยได้มีโอกาสเข้าแข่งขัน ai hackathon ของทาง cai ซึ่งผมจะได้ทำหน้าที่ทางด้าน business ซะมากว่าหลังจากแข่งขันจบทำให้ผมรู้ตัวเองว่ายังมีความรู้และความสามารถในการเขียนโปรแกรมไม่มากพอจึงช่วยทีมด้าน technical ได้ไม่มากนักแต่ผมก็อยากที่จะเป็นผู้สร้างด้วยตนเอง ทำให้ผมอยากจะพัฒนาความรู้ในด้านนี้ของตัวเองและเมื่อได้รู้จักกับโครงการ ai builders และได้เห็นผลงานของแต่ละผู้เข้าร่วมรวมถึงผลงานของรุ่นพี่ที่ผมรู้จักที่สุดยอดและน่าสนใจมากๆ ทำให้ผมคิดว่านี่เป็นโอกาสที่ผมจะพลาดไม่ได้ และโครงการนี้จะทำให้ผมได้เพิ่มไฟในการเรียนรู้ของผมด้วยจากการที่ได้รู้จักกับเพื่อนๆ ใหม่ที่มีแพชชั่นด้านเดียวกันทำให้ผลัดดันกันไปมากขึ้นครับ และผมก็อยากที่จะทำ project เพื่อพัฒนา skill ของตัวเองและช่วยแก้ไขปัญหาของผู้คนได้ ซึ่งการที่มี mentor ที่มีประสบการณ์มากมายของทางโครงการช่วยให้คำปรึกษา ผมคิดว่าจะทำให้ผมได้ไอเดีย และความรู้ ที่จะช่วยต่อยอดและพัฒนาตัวผมในการนำไปใช้กับ project ในอนาคตรวมถึงสายงานนี้ให้ดียิ่งขึ้นอีกครับ\n    ","date":"31-7-24","title":"Knee Osteoarthritis Classification","builder":"ชนันชัย จันทร์มล(เก้า)","builder_info":"สมุทรสาครบูรณะ / สมุทรสาคร","thumbnail":"/images/2024/25/01.png","links":{"github":"https://github.com/OkaShino9/Knee-OA-Classification-by-KL-Grading","facebook":"","blog":"https://medium.com/@kungkao123456789/knee-osteoarthritis-classification-by-kellgren-and-lawrence-grading-system-with-fast-ai-2738287b0c2e"}}},"__N_SSG":true}