{"pageProps":{"postData":{"id":"109-profanityguard-youtube","content":"\n![image](/images/2023/109/01.jpg)\n\n    \n- โมเดลตรวจจับคำหยาบภาษาไทยด้วยการพัฒนาต่อจาก airesearch/wav2vec2-large-xlsr-53-th ที่ถูกเทรนบนข้อมูล Common Voice 7.0 ประมาณ 133 ชั่วโมง แต่ปัญหาคือข้อมูลนั้นมีคำหยาบอยู่น้อย จึงได้พัฒนาด้วยการเพิ่มข้อมูลคำหยาบเข้าไป\n- ปัจจุบันอาชีพ youtuber หรือ streamer ที่กำลังเป็นที่นิยมนั้นได้สร้างสรรค์ผลงานของพวกเขาผ่านแพลตฟอร์ม youtube แต่พวกเขาบางท่านก็ต้องประสบปัญหา คลิปวีดีโอติดเหลือง หรือ ติดแดง (ติดเหลือง: ผู้ลงโฆษณาทุกรายแสดงโฆษณาในเนื้อหาของคุณได้ในจำนวนจำกัดหรือไม่ได้เลย ติดแดง: คุณเปิดการสร้างรายได้แล้ว แต่วิดีโอไม่มีสิทธิ์สร้างรายได้เนื่องจากมีการร้องเรียนการละเมิดลิขสิทธิ์ อ้างอิงจาก support.google)ทำให้ขาดรายได้เพียงเพราะการสร้างความบันเทิงให้กับผู้ชมของเขานั้นมีคำหยาบเพียงไม่กี่คำในคลิปวีดีโอ\n- สร้างชุดข้อมูลขึ้นมาเองจากคลิปวีดีโอใน Youtube โดยการแบ่งทั้งคลิปออกเป็นช่วงสั้นๆ ช่วงละ 5 วินาที ผ่าน Audacity จากนั้นก็ฟังและทำ Subtitle ขึ้นมา แต่ก็มีบางวีดีโอใน Youtube ที่มี Subtitle อยู่แล้วก็สามารถนำมาตรวจสอบอีกครั้งผ่าน Subtitle-edit แล้วนำไปคลีนต่ออีกนิดหน่อย โดยการลบ อักขระพิเศษทิ้งและตัวเลขทิ้ง เช่น. ? ! # $ & 1 2 3แก้ ๆ เช่นทำตัวโง่ๆ เป็นทำตัวโง่โง่แก้ ำ เป็น ํ า และ เ เ เป็น แ\n- Finetune โมเดลด้วยข้อมูลที่มีคำหยาบทำให้การถอดความคำหยาบดีขึ้นจาก F1 0.41 เป็น 0.89\n- อย่างแรกที่สังเกตุได้เลยคือคำที่ออกเสียงได้เหมือนกันโมเดลอาจจะมีการทายผิดบ้างตัวอย่างเช่น ไอ้เวร แต่โมเดลทายว่า ไอ้เวน หรือ คำว่า เหล้า แต่กลายเป็น เร่า สาเหตุเนื่องจากData set น้อยไปทำให้โมเดลไม่รู้จักคำพวกนี้ดีพอ อาจจะแก้ด้วยการเพิ่มคำใน Array ที่ใช้ตรวจจับให้ครอบคลุมกว่านี้\n- อย่างที่สองคือ การ label โดยใช้การแบ่งคลิปเป็น 5 วินาทีทำให้บางไฟล์เสียงอาจจะไม่ครบองค์ประกอบประโยค ทำให้ผมที่ label แบบครบองค์ประกอบประโยคไม่ตรงกับที่ทายมา เช่น เหี้ยแบบโดนกระชากเสื้อไป ทายเป็น ี้ยแบบโดนกระชากเสื้อกไป ทำให้เกิด errorขึ้นได้ทั้งๆที่โมเดลทายถูกแล้ว วิธีแก้คือ ต้องขยัน ไม่ตัดคลิปแบบห้วนๆ ต้องตัดไปทั้งประโยคนั่นเอง\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> ปัจจุบันโลกได้มีการเปลี่ยนแปลงมาสู่ยุคแห่งเทคโนโลยี จึงส่งผลให้เทคโนโลยีมีผลอย่างมากในโลกในปัจจุบันและชีวิตประจำวันของมนุษย์ รวมถึงธุรกิจต่างก็มีความเกี่ยวข้องและต้องการเทคโนโลยีในการพัฒนาสินค้าและบริการของลูกค้า การวิเคราะห์ข้อมูลผ่าน ai จึงเข้ามามีบทบาทอย่างมาก ด้วยเหตุนี้ข้าพเจ้าจึงอยากที่จะเข้าร่วมกิจกรรม ai builders ในขณะที่ข้าพเจ้ากำลังศึกษาก็ได้ร่วมกิจกรรมแข่งขันมากมาย ทำให้ข้พเจ้ามีความรู้ทั้งด้าน ซอฟต์แแวร์และฮาร์ดแวร์ รวมไปถึงการพัฒนาทักษะต่างๆ เช่น ความเป็นความผู้นำ ความคิดสร้างสรรค์และการทำงานเป็นทีมซึ่งความตั้งใจของข้าพเจ้าส่งผลข้าพเจ้าได้รับรางวัลในด้านคอมพิวเตอร์และได้มีโอกาสเข้าร่วม สอวน. คอมพิวเตอร์ค่าย2 ทำให้ข้าพเจ้าได้เรียนรู้ ภาษา c++ และมีความรู้ในภาษาอื่นๆ จากการเรียนรู้เอง จนทำให้ข้าพเจ้ามั่นใจว่ามีความชื่นชอบด้านการเขียนโปรแกรมและอยากสานฝันในการเป็นส่วนหนึ่งในการพัฒนาโปรแกรม แต่สิ่งที่ข้าพเจ้าได้เรียนรู้มายังขาดอีก 1 บทเรียนที่สำคัญนั่นก็คือปัญญาประดิษฐ์ ที่เป็นประโยช์กับมนุษย์อย่างมากทั้งในด้านธุรกิจและในชีวิตประจำวัน เช่น chat-gpt ที่ทำให้การค้นหาเป็นไปได้อย่างรวดเร็วและตรงกับสิ่งที่ค้นหา เพราะฉะนั้นข้าพเจ้าจึงอยากที่จะพัฒนาความรู้ผ่านกิจกรรม ai builders ทั้งนี้การเข้าร่วมกิจกรรม ai builders เป็นโอกาสสำคัญในชีวิตของข้าพเจ้า ที่จะได้เป็นส่วนหนึ่งในการพัฒนาสังคมและประกอบอาชีพตามที่ข้าพเจ้าได้วางแผนไว้ หากข้าพเจ้าได้รับคัดเลือกเข้ากิจกรรม ข้าพเจ้ามั่นใจว่าจะสามารถพัฒนาตนเองได้อย่างเต็มศักยภาพ สร้างสรรค์โครงงานอย่างตั้งใจ\n    ","date":"31-7-24","title":"ProfanityGuard ตรวจจับคำหยาบด้วย AI ก่อนนำไปลง Youtube","builder":"Pasit Khumsena","builder_info":"มัธยมศึกษาปีที่ 6.0 -- มหาสารคาม","thumbnail":"/images/2023/109/01.jpg","links":{"github":"https://github.com/webbalaka/ProfanityGuard","facebook":"https://www.facebook.com/aibuildersx/posts/pfbid02H19CKNNGPp1MUHTBHsfHTTFBA7WLiokVYjxfrL1TMV5bBf3v3JnJaY7q5jjjdp6Pl","blog":"https://medium.com/@webbalaka/profanityguard-%E0%B8%95%E0%B8%A3%E0%B8%A7%E0%B8%88%E0%B8%88%E0%B8%B1%E0%B8%9A%E0%B8%84%E0%B8%B3%E0%B8%AB%E0%B8%A2%E0%B8%B2%E0%B8%9A%E0%B8%94%E0%B9%89%E0%B8%A7%E0%B8%A2-ai-%E0%B8%81%E0%B9%88%E0%B8%AD%E0%B8%99%E0%B8%99%E0%B8%B3%E0%B9%84%E0%B8%9B%E0%B8%A5%E0%B8%87-youtube-792c09c027ff"}}},"__N_SSG":true}