{"pageProps":{"postData":{"id":"7-guntee-doungmanee","content":"\n![image](/images/2024/7/01.png)\n\n- สร้างโมเดล ThaiVecFont สำหรับการสร้างฟอนต์เพื่อลดปัญหาการทำงานซ้ำๆ ของนักออกแบบฟอนต์ไทย และเป็นโมเดลสำหรับสร้างฟอนต์ SVG ที่สามารถนำไปใช้งานได้จริงได้\n- เป็นการใช้สถาปัตยกรรม DeepVecFont-V2 ที่มีพื้นฐานเป็น Transformers Autoencoder โดยมี Encoder และ Decoder อย่างละ 2 ตัว\n- ใช้ Dataset ที่ scrape จาก thaifaces.com เว็บคุณภาพที่รวบรวมฟอนต์ไทยจากทุกทิศทางเอาไว้ \nทำ Data Cleaning ฟอนต์ที่ขนาดใหญ่และเล็กเกินไปออก\n- Preprocessing ด้วยการแปลงไฟล์ฟอนต์ให้เป็นรูปภาพและ vector sequence ทำการคัดฟอนต์ที่มีจำนวน sequence มากเกินไปออก ทำ Data Augmentation และใช้เทคนิค relaxation representation เพื่อเพิ่มจำนวนจุดให้กับ sequence ทำให้ตอนเทรนได้ผลดีขึ้น\n- ใช้เทคนิค Modality Fusion รวม feature ระหว่าง Encoder 2 ตัวเข้าด้วยกัน เพื่อให้โมเดลสามารถเข้าใจรูปร่างและโครงสร้างของฟอนต์ไปพร้อมกันได้\n- ปรับค่า weight โดยใช้ Loss คำนวนจาก L1 Loss จากการสร้างรูปภาพและ Cross Entropy Loss จากการสร้าง vector sequence\n- เมื่อเปรียบเทียบกับโมเดล DeepVecFont เวอร์ชั่นแรกที่ใช้ CNN เป็น Encoder ผลที่เกิดขึ้นคือเวอร์ชั่นแรกไม่สามารถจับลักษณะของฟอนต์ภาษาไทยได้ แต่ DeepVecFont-V2 สามารถทำได้\n- วัดผลโดยการประเมิน L1 Error ของรูปภาพ พบว่าโมเดล DeepVecFont-V2 ที่เทรนด้วยชุดข้อมูลที่มีการทำ Augmentation ให้ผลที่ดีกว่าแบบที่เทรนด้วยชุดข้อมูลปกติ\n- ข้อเสนอแนะ (เพิ่มเติม) ประสิทธิภาพโมเดลที่ได้ยังไม่ดีเท่าโมเดล DeepVecFont-V2 ที่เทรนด้วยชุดข้อมูลภาษาอังกฤษที่มีขนาดใหญ่ คาดว่าเนื่องจากจำนวนชุดข้อมูลฟอนต์ภาษาไทยที่ไม่เพียงพอ จึงคิดหาวิธีแก้โดยอาจมีการทดลอง fine-tuning โมเดล pretrained ภาษาอังกฤษด้วยชุดข้อมูลภาษาไทยในอนาคต รวมถึงหาวิธีใหม่ ๆ ในการเพิ่มชุดข้อมูล\n\n### แรงจูงในในการเข้าร่วมโครงการ (จากใบสมัครเข้าร่วมเมื่อ 10 สัปดาห์ที่แล้ว)\n\n> ปีที่แล้วผมไม่ติดโครงการนี้ ปีนี้เลยอยากจะแก้มือใหม่ ผมเชื่อในการเรียนรู้แบบ based on project ว่ามันจะช่วยพัฒนาสกิลเราขึ้นได้อย่างก้าวกระโดด หากยิ่งมีคนที่คอย support เรามากผลที่ได้มันยิ่งมหาศาลมากขึ้นไปอีกมาก การเข้าโครงการนี้จะเปิดโอกาสให้ผมสามารถทำสิ่งที่ผมชอบได้ หลายๆ อย่างที่เป็นไปไม่ได้ ผมเชื่อว่า มันสามารถที่จะเป็นไปได้ ถ้าเราทุ่มเทให้สุดแรงลงไป รวมถึงมีคน support ที่ดี โครงการนี้จะทำให้ผมได้ connection กับเพื่อน ๆ พี่ ๆ นักวิจัยนักพัฒนา ai แนวหน้าของประเทศและจะได้ต่อยอดไปในการทำงานในอนาคตได้ ที่สำคัญ ผมจะได้เจอคนทำ wangchanberta ตัวเป็นๆ ยังไม่พอ สามารถปรึกษาได้ด้วยอีก !!\n    ","date":"31-7-24","title":"Synthesize High-Quality Thai Vector Fonts","builder":"กันต์ธีร์ ดวงมณี(พอเพียง)","builder_info":"ยุพราชวิทยาลัย / เชียงใหม่","thumbnail":"/images/2024/7/01.png","links":{"github":"https://github.com/microhum/ThaiVecFont","facebook":"","blog":"https://medium.com/@guntee12123/synthesize-high-quality-thai-vector-fonts-with-deepvecfont-v2-a123317e1910"}}},"__N_SSG":true}